interface CitiesList {
    id: number;
    name: string;
}

export const CityisListObjects: CitiesList[] = [
      {
         
        name: "Абрамцево"
      },
      {
         
        name: "Алабино"
      },
      {
         
        name: "Апрелевка"
      },
      {
         
        name: "Архангельское"
      },
      {
         
        name: "Ашитково"
      },
      {
         
        name: "Байконур"
      },
      {
         
        name: "Бакшеево"
      },
      {
         
        name: "Балашиха"
      },
      {
         
        name: "Барыбино"
      },
      {
         
        name: "Белоомут"
      },
      {
         
        name: "Белые Столбы"
      },
      {
         
        name: "Бородино"
      },
      {
         
        name: "Бронницы"
      },
      {
         
        name: "Быково"
      },
      {
         
        name: "Валуево"
      },
      {
         
        name: "Вербилки"
      },
      {
         
        name: "Верея"
      },
      {
         
        name: "Видное"
      },
      {
         
        name: "Внуково"
      },
      {
         
        name: "Вождь Пролетариата"
      },
      {
         
        name: "Волоколамск"
      },
      {
         
        name: "Вороново"
      },
      {
         
        name: "Воскресенск"
      },
      {
         
        name: "Восточный"
      },
      {
         
        name: "Востряково"
      },
      {
         
        name: "Высоковск"
      },
      {
         
        name: "Голицино"
      },
      {
         
        name: "Деденево"
      },
      {
         
        name: "Дедовск"
      },
      {
         
        name: "Джержинский"
      },
      {
         
        name: "Дмитров"
      },
      {
         
        name: "Долгопрудный"
      },
      {
         
        name: "Домодедово"
      },
      {
         
        name: "Дорохово"
      },
      {
         
        name: "Дрезна"
      },
      {
         
        name: "Дубки"
      },
      {
         
        name: "Дубна"
      },
      {
         
        name: "Егорьевск"
      },
      {
         
        name: "Железнодорожный"
      },
      {
         
        name: "Жилево"
      },
      {
         
        name: "Жуковский"
      },
      {
         
        name: "Загорск"
      },
      {
         
        name: "Загорянский"
      },
      {
         
        name: "Запрудная"
      },
      {
         
        name: "Зарайск"
      },
      {
         
        name: "Звенигород"
      },
      {
         
        name: "Зеленоград"
      },
      {
         
        name: "Ивантеевка"
      },
      {
         
        name: "Икша"
      },
      {
         
        name: "Ильинский"
      },
      {
         
        name: "Истра"
      },
      {
         
        name: "Калининград"
      },
      {
         
        name: "Кашира"
      },
      {
         
        name: "Керва"
      },
      {
         
        name: "Климовск"
      },
      {
         
        name: "Клин"
      },
      {
         
        name: "Клязьма"
      },
      {
         
        name: "Кожино"
      },
      {
         
        name: "Кокошкино"
      },
      {
         
        name: "Коломна"
      },
      {
         
        name: "Колюбакино"
      },
      {
         
        name: "Королев"
      },
      {
         
        name: "Косино"
      },
      {
         
        name: "Котельники"
      },
      {
         
        name: "Красково"
      },
      {
         
        name: "Красноармейск"
      },
      {
         
        name: "Красногорск"
      },
      {
         
        name: "Краснозаводск"
      },
      {
         
        name: "Краснознаменск"
      },
      {
         
        name: "Красный Ткач"
      },
      {
         
        name: "Крюково"
      },
      {
         
        name: "Кубинка"
      },
      {
         
        name: "Купавна"
      },
      {
         
        name: "Куровское"
      },
      {
         
        name: "Лесной Городок"
      },
      {
         
        name: "Ликино-Дулево"
      },
      {
         
        name: "Лобня"
      },
      {
         
        name: "Лопатинский"
      },
      {
         
        name: "Лосино-Петровский"
      },
      {
         
        name: "Лотошино"
      },
      {
         
        name: "Лукино"
      },
      {
         
        name: "Луховицы"
      },
      {
         
        name: "Лыткарино"
      },
      {
         
        name: "Львовский"
      },
      {
         
        name: "Люберцы"
      },
      {
         
        name: "Малаховка"
      },
      {
         
        name: "Михайловское"
      },
      {
         
        name: "Михнево"
      },
      {
         
        name: "Можайск"
      },
      {
         
        name: "Монино"
      },
      {
         
        name: "Муханово"
      },
      {
         
        name: "Мытищи"
      },
      {
         
        name: "Нарофоминск"
      },
      {
         
        name: "Нахабино"
      },
      {
         
        name: "Некрасовка"
      },
      {
         
        name: "Немчиновка"
      },
      {
         
        name: "Новобратцевский"
      },
      {
         
        name: "Новоподрезково"
      },
      {
         
        name: "Ногинск"
      },
      {
         
        name: "Обухово"
      },
      {
         
        name: "Одинцово"
      },
      {
         
        name: "Ожерелье"
      },
      {
         
        name: "Озеры"
      },
      {
         
        name: "Октябрьский"
      },
      {
         
        name: "Опалиха"
      },
      {
         
        name: "Орехово-Зуево"
      },
      {
         
        name: "Павловский Посад"
      },
      {
         
        name: "Первомайский"
      },
      {
         
        name: "Пески"
      },
      {
         
        name: "Пироговский"
      },
      {
         
        name: "Подольск"
      },
      {
         
        name: "Полушкино"
      },
      {
         
        name: "Правдинский"
      },
      {
         
        name: "Привокзальный"
      },
      {
         
        name: "Пролетарский"
      },
      {
         
        name: "Протвино"
      },
      {
         
        name: "Пушкино"
      },
      {
         
        name: "Пущино"
      },
      {
         
        name: "Радовицкий"
      },
      {
         
        name: "Раменское"
      },
      {
         
        name: "Реутов"
      },
      {
         
        name: "Решетниково"
      },
      {
         
        name: "Родники"
      },
      {
         
        name: "Рошаль"
      },
      {
         
        name: "Рублево"
      },
      {
         
        name: "Руза"
      },
      {
         
        name: "Салтыковка"
      },
      {
         
        name: "Северный"
      },
      {
         
        name: "Сергиев Посад"
      },
      {
         
        name: "Серебряные Пруды"
      },
      {
         
        name: "Серпухов"
      },
      {
         
        name: "Солнечногорск"
      },
      {
         
        name: "Солнцево"
      },
      {
         
        name: "Софрино"
      },
      {
         
        name: "Старая Купавна"
      },
      {
         
        name: "Старбеево"
      },
      {
         
        name: "Ступино"
      },
      {
         
        name: "Сходня"
      },
      {
         
        name: "Талдом"
      },
      {
         
        name: "Текстильщик"
      },
      {
         
        name: "Темпы"
      },
      {
         
        name: "Тишково"
      },
      {
         
        name: "Томилино"
      },
      {
         
        name: "Троицк"
      },
      {
         
        name: "Туголесский Бор"
      },
      {
         
        name: "Тучково"
      },
      {
         
        name: "Уваровка"
      },
      {
         
        name: "Удельная"
      },
      {
         
        name: "Успенское"
      },
      {
         
        name: "Фирсановка"
      },
      {
         
        name: "Фосфоритный"
      },
      {
         
        name: "Фрязино"
      },
      {
         
        name: "Фряново"
      },
      {
         
        name: "Химки"
      },
      {
         
        name: "Хорлово"
      },
      {
         
        name: "Хотьково"
      },
      {
         
        name: "Черкизово"
      },
      {
         
        name: "Черноголовка"
      },
      {
         
        name: "Черусти"
      },
      {
         
        name: "Чехов"
      },
      {
         
        name: "Шарапово"
      },
      {
         
        name: "Шатура"
      },
      {
         
        name: "Шатурторф"
      },
      {
         
        name: "Шаховская"
      },
      {
         
        name: "Шереметьевский"
      },
      {
         
        name: "Щелково"
      },
      {
         
        name: "Щербинка"
      },
      {
         
        name: "Электрогорск"
      },
      {
         
        name: "Электросталь"
      },
      {
         
        name: "Электроугли"
      },
      {
         
        name: "Яхрома"
      },
      {
        
        name: "Санкт-Петербург"
      },
      {
        
        name: "Александровская"
      },
      {
        
        name: "Бокситогорск"
      },
      {
        
        name: "Большая Ижора"
      },
      {
        
        name: "Будогощь"
      },
      {
        
        name: "Вознесенье"
      },
      {
        
        name: "Волосово"
      },
      {
        
        name: "Волхов"
      },
      {
        
        name: "Всеволожск"
      },
      {
        
        name: "Выборг"
      },
      {
        
        name: "Вырица"
      },
      {
        
        name: "Высоцк"
      },
      {
        
        name: "Гатчина"
      },
      {
        
        name: "Дружная Горка"
      },
      {
        
        name: "Дубровка"
      },
      {
        
        name: "Ефимовский"
      },
      {
        
        name: "Зеленогорск"
      },
      {
        
        name: "Ивангород"
      },
      {
        
        name: "Каменногорск"
      },
      {
        
        name: "Кикерино"
      },
      {
        
        name: "Кингисепп"
      },
      {
        
        name: "Кириши"
      },
      {
        
        name: "Кировск"
      },
      {
        
        name: "Кобринское"
      },
      {
        
        name: "Колпино"
      },
      {
        
        name: "Коммунар"
      },
      {
        
        name: "Кронштадт"
      },
      {
        
        name: "Лисий Нос"
      },
      {
        
        name: "Лодейное Поле"
      },
      {
        
        name: "Ломоносов"
      },
      {
        
        name: "Луга"
      },
      {
        
        name: "Павловск"
      },
      {
        
        name: "Парголово"
      },
      {
        
        name: "Петродворец"
      },
      {
        
        name: "Пикалёво"
      },
      {
        
        name: "Подпорожье"
      },
      {
        
        name: "Приозерск"
      },
      {
        
        name: "Пушкин"
      },
      {
        
        name: "Сестрорецк"
      },
      {
        
        name: "Сланцы"
      },
      {
        
        name: "Сосновый Бор"
      },
      {
        
        name: "Тихвин"
      },
      {
        
        name: "Тосно"
      },
      {
        
        name: "Шлиссельбург"
      },
      {
        
        name: "Адыгейск"
      },
      {
        
        name: "Майкоп"
      },
      {
        
        name: "Акташ"
      },
      {
        
        name: "Акутиха"
      },
      {
        
        name: "Алейск"
      },
      {
        
        name: "Алтайский"
      },
      {
        
        name: "Баево"
      },
      {
        
        name: "Барнаул"
      },
      {
        
        name: "Белово"
      },
      {
        
        name: "Белокуриха"
      },
      {
        
        name: "Белоярск"
      },
      {
        
        name: "Бийск"
      },
      {
        
        name: "Благовещенск"
      },
      {
        
        name: "Боровлянка"
      },
      {
        
        name: "Бурла"
      },
      {
        
        name: "Бурсоль"
      },
      {
        
        name: "Волчиха"
      },
      {
        
        name: "Горно-Алтайск"
      },
      {
        
        name: "Горняк"
      },
      {
        
        name: "Ельцовка"
      },
      {
        
        name: "Залесово"
      },
      {
        
        name: "Заринск"
      },
      {
        
        name: "Заток"
      },
      {
        
        name: "Змеиногорск"
      },
      {
        
        name: "Камень-на-Оби"
      },
      {
        
        name: "Ключи"
      },
      {
        
        name: "Кош-Агач"
      },
      {
        
        name: "Красногорское"
      },
      {
        
        name: "Краснощеково"
      },
      {
        
        name: "Кулунда"
      },
      {
        
        name: "Кытманово"
      },
      {
        
        name: "Мамонтово"
      },
      {
        
        name: "Новичиха"
      },
      {
        
        name: "Новоалтайск"
      },
      {
        
        name: "Онгудай"
      },
      {
        
        name: "Павловск"
      },
      {
        
        name: "Петропавловское"
      },
      {
        
        name: "Поспелиха"
      },
      {
        
        name: "Ребриха"
      },
      {
        
        name: "Родино"
      },
      {
        
        name: "Рубцовск"
      },
      {
        
        name: "Славгород"
      },
      {
        
        name: "Смоленское"
      },
      {
        
        name: "Солонешное"
      },
      {
        
        name: "Солтон"
      },
      {
        
        name: "Староаллейское"
      },
      {
        
        name: "Табуны"
      },
      {
        
        name: "Тальменка"
      },
      {
        
        name: "Топчиха"
      },
      {
        
        name: "Троицкое"
      },
      {
        
        name: "Турочак"
      },
      {
        
        name: "Тюменцево"
      },
      {
        
        name: "Угловское"
      },
      {
        
        name: "Усть-Калманка"
      },
      {
        
        name: "Усть-Кан"
      },
      {
        
        name: "Усть-Кокса"
      },
      {
        
        name: "Усть-Улаган"
      },
      {
        
        name: "Усть-Чарышская Пристань"
      },
      {
        
        name: "Хабары"
      },
      {
        
        name: "Целинное"
      },
      {
        
        name: "Чарышское"
      },
      {
        
        name: "Шебалино"
      },
      {
        
        name: "Шелаболиха"
      },
      {
        
        name: "Шипуново"
      },
      {
        
        name: "Айгунь"
      },
      {
        
        name: "Архара"
      },
      {
        
        name: "Белогорск"
      },
      {
        
        name: "Благовещенск (Амурская обл.)"
      },
      {
        
        name: "Бурея"
      },
      {
        
        name: "Возжаевка"
      },
      {
        
        name: "Екатеринославка"
      },
      {
        
        name: "Ерофей Павлович"
      },
      {
        
        name: "Завитинск"
      },
      {
        
        name: "Зея"
      },
      {
        
        name: "Златоустовск"
      },
      {
        
        name: "Ивановка"
      },
      {
        
        name: "Коболдо"
      },
      {
        
        name: "Магдагачи"
      },
      {
        
        name: "Новобурейский"
      },
      {
        
        name: "Поярково"
      },
      {
        
        name: "Райчихинск"
      },
      {
        
        name: "Ромны"
      },
      {
        
        name: "Свободный"
      },
      {
        
        name: "Серышево"
      },
      {
        
        name: "Сковородино"
      },
      {
        
        name: "Стойба"
      },
      {
        
        name: "Тамбовка"
      },
      {
        
        name: "Тында"
      },
      {
        
        name: "Шимановск"
      },
      {
        
        name: "Экимчан"
      },
      {
        
        name: "Ядрино"
      },
      {
        
        name: "Амдерма"
      },
      {
        
        name: "Архангельск"
      },
      {
        
        name: "Березник"
      },
      {
        
        name: "Вельск"
      },
      {
        
        name: "Верхняя Тойма"
      },
      {
        
        name: "Волошка"
      },
      {
        
        name: "Вычегодский"
      },
      {
        
        name: "Емца"
      },
      {
        
        name: "Илеза"
      },
      {
        
        name: "Ильинско-Подомское"
      },
      {
        
        name: "Каргополь"
      },
      {
        
        name: "Карпогоры"
      },
      {
        
        name: "Кодино"
      },
      {
        
        name: "Коноша"
      },
      {
        
        name: "Коряжма"
      },
      {
        
        name: "Котлас"
      },
      {
        
        name: "Красноборск"
      },
      {
        
        name: "Лешуконское"
      },
      {
        
        name: "Мезень"
      },
      {
        
        name: "Мирный"
      },
      {
        
        name: "Нарьян-Мар"
      },
      {
        
        name: "Новодвинск"
      },
      {
        
        name: "Няндома"
      },
      {
        
        name: "Онега"
      },
      {
        
        name: "Пинега"
      },
      {
        
        name: "Плесецк"
      },
      {
        
        name: "Северодвинск"
      },
      {
        
        name: "Сольвычегодск"
      },
      {
        
        name: "Холмогоры"
      },
      {
        
        name: "Шенкурск"
      },
      {
        
        name: "Яренск"
      },
      {
        
        name: "Астрахань"
      },
      {
        
        name: "Ахтубинск"
      },
      {
        
        name: "Верхний Баскунчак"
      },
      {
        
        name: "Володарский"
      },
      {
        
        name: "Енотаевка"
      },
      {
        
        name: "Икряное"
      },
      {
        
        name: "Камызяк"
      },
      {
        
        name: "Капустин Яр"
      },
      {
        
        name: "Красный Яр"
      },
      {
        
        name: "Лиман"
      },
      {
        
        name: "Началово"
      },
      {
        
        name: "Харабали"
      },
      {
        
        name: "Черный Яр"
      },
      {
        
        name: "Аксаково"
      },
      {
        
        name: "Амзя"
      },
      {
        
        name: "Аскино"
      },
      {
        
        name: "Баймак"
      },
      {
        
        name: "Бакалы"
      },
      {
        
        name: "Белебей"
      },
      {
        
        name: "Белорецк"
      },
      {
        
        name: "Бижбуляк"
      },
      {
        
        name: "Бирск"
      },
      {
        
        name: "Благовещенск"
      },
      {
        
        name: "Большеустьикинское"
      },
      {
        
        name: "Бураево"
      },
      {
        
        name: "Верхнеяркеево"
      },
      {
        
        name: "Верхние Киги"
      },
      {
        
        name: "Верхние Татышлы"
      },
      {
        
        name: "Верхний Авзян"
      },
      {
        
        name: "Давлеканово"
      },
      {
        
        name: "Дуван"
      },
      {
        
        name: "Дюртюли"
      },
      {
        
        name: "Ермекеево"
      },
      {
        
        name: "Ермолаево"
      },
      {
        
        name: "Зилаир"
      },
      {
        
        name: "Зирган"
      },
      {
        
        name: "Иглино"
      },
      {
        
        name: "Инзер"
      },
      {
        
        name: "Исянгулово"
      },
      {
        
        name: "Ишимбай"
      },
      {
        
        name: "Кананикольское"
      },
      {
        
        name: "Кандры"
      },
      {
        
        name: "Караидель"
      },
      {
        
        name: "Караидельский"
      },
      {
        
        name: "Киргиз-Мияки"
      },
      {
        
        name: "Красноусольский"
      },
      {
        
        name: "Кумертау"
      },
      {
        
        name: "Кушнаренково"
      },
      {
        
        name: "Малояз"
      },
      {
        
        name: "Мелеуз"
      },
      {
        
        name: "Месягутово"
      },
      {
        
        name: "Мраково"
      },
      {
        
        name: "Нефтекамск"
      },
      {
        
        name: "Октябрьский"
      },
      {
        
        name: "Раевский"
      },
      {
        
        name: "Салават"
      },
      {
        
        name: "Сибай"
      },
      {
        
        name: "Старобалтачево"
      },
      {
        
        name: "Старосубхангулово"
      },
      {
        
        name: "Стерлибашево"
      },
      {
        
        name: "Стерлитамак"
      },
      {
        
        name: "Туймазы"
      },
      {
        
        name: "Уфа"
      },
      {
        
        name: "Учалы"
      },
      {
        
        name: "Федоровка"
      },
      {
        
        name: "Чекмагуш"
      },
      {
        
        name: "Чишмы"
      },
      {
        
        name: "Шаран"
      },
      {
        
        name: "Янаул"
      },
      {
        
        name: "Алексеевка"
      },
      {
        
        name: "Белгород"
      },
      {
        
        name: "Борисовка"
      },
      {
        
        name: "Валуйки"
      },
      {
        
        name: "Вейделевка"
      },
      {
        
        name: "Волоконовка"
      },
      {
        
        name: "Грайворон"
      },
      {
        
        name: "Губкин"
      },
      {
        
        name: "Ивня"
      },
      {
        
        name: "Короча"
      },
      {
        
        name: "Красногвардейское"
      },
      {
        
        name: "Новый Оскол"
      },
      {
        
        name: "Ракитное"
      },
      {
        
        name: "Ровеньки"
      },
      {
        
        name: "Старый Оскол"
      },
      {
        
        name: "Строитель"
      },
      {
        
        name: "Чернянка"
      },
      {
        
        name: "Шебекино"
      },
      {
        
        name: "Алтухово"
      },
      {
        
        name: "Белая Березка"
      },
      {
        
        name: "Белые Берега"
      },
      {
        
        name: "Большое Полпино"
      },
      {
        
        name: "Брянск"
      },
      {
        
        name: "Бытошь"
      },
      {
        
        name: "Выгоничи"
      },
      {
        
        name: "Вышков"
      },
      {
        
        name: "Гордеевка"
      },
      {
        
        name: "Дубровка"
      },
      {
        
        name: "Дятьково"
      },
      {
        
        name: "Жирятино"
      },
      {
        
        name: "Жуковка"
      },
      {
        
        name: "Злынка"
      },
      {
        
        name: "Ивот"
      },
      {
        
        name: "Карачев"
      },
      {
        
        name: "Клетня"
      },
      {
        
        name: "Климово"
      },
      {
        
        name: "Клинцы"
      },
      {
        
        name: "Кокаревка"
      },
      {
        
        name: "Комаричи"
      },
      {
        
        name: "Красная Гора"
      },
      {
        
        name: "Локоть"
      },
      {
        
        name: "Мглин"
      },
      {
        
        name: "Навля"
      },
      {
        
        name: "Новозыбков"
      },
      {
        
        name: "Погар"
      },
      {
        
        name: "Почеп"
      },
      {
        
        name: "Ржаница"
      },
      {
        
        name: "Рогнедино"
      },
      {
        
        name: "Севск"
      },
      {
        
        name: "Стародуб"
      },
      {
        
        name: "Суземка"
      },
      {
        
        name: "Сураж"
      },
      {
        
        name: "Трубчевск"
      },
      {
        
        name: "Унеча"
      },
      {
        
        name: "Бабушкин"
      },
      {
        
        name: "Багдарин"
      },
      {
        
        name: "Баргузин"
      },
      {
        
        name: "Баянгол"
      },
      {
        
        name: "Бичура"
      },
      {
        
        name: "Выдрино"
      },
      {
        
        name: "Гусиное Озеро"
      },
      {
        
        name: "Гусиноозерск"
      },
      {
        
        name: "Заиграево"
      },
      {
        
        name: "Закаменск"
      },
      {
        
        name: "Иволгинск"
      },
      {
        
        name: "Илька"
      },
      {
        
        name: "Кабанск"
      },
      {
        
        name: "Каменск"
      },
      {
        
        name: "Кижинга"
      },
      {
        
        name: "Курумкан"
      },
      {
        
        name: "Кырен"
      },
      {
        
        name: "Кяхта"
      },
      {
        
        name: "Монды"
      },
      {
        
        name: "Мухоршибирь"
      },
      {
        
        name: "Нижнеангарск"
      },
      {
        
        name: "Орлик"
      },
      {
        
        name: "Петропавловка"
      },
      {
        
        name: "Романовка"
      },
      {
        
        name: "Северобайкальск"
      },
      {
        
        name: "Селенгинск"
      },
      {
        
        name: "Сосново-Озерское"
      },
      {
        
        name: "Таксимо"
      },
      {
        
        name: "Турунтаево"
      },
      {
        
        name: "Улан-Удэ"
      },
      {
        
        name: "Хоринск"
      },
      {
        
        name: "Александров"
      },
      {
        
        name: "Андреево"
      },
      {
        
        name: "Анопино"
      },
      {
        
        name: "Бавлены"
      },
      {
        
        name: "Балакирево"
      },
      {
        
        name: "Боголюбово"
      },
      {
        
        name: "Великодворский"
      },
      {
        
        name: "Вербовский"
      },
      {
        
        name: "Владимир"
      },
      {
        
        name: "Вязники"
      },
      {
        
        name: "Городищи"
      },
      {
        
        name: "Гороховец"
      },
      {
        
        name: "Гусевский"
      },
      {
        
        name: "Гусь Хрустальный"
      },
      {
        
        name: "Золотково"
      },
      {
        
        name: "Иванищи"
      },
      {
        
        name: "Камешково"
      },
      {
        
        name: "Карабаново"
      },
      {
        
        name: "Киржач"
      },
      {
        
        name: "Ковров"
      },
      {
        
        name: "Кольчугино"
      },
      {
        
        name: "Красная Горбатка"
      },
      {
        
        name: "Меленки"
      },
      {
        
        name: "Муром"
      },
      {
        
        name: "Петушки"
      },
      {
        
        name: "Покров"
      },
      {
        
        name: "Собинка"
      },
      {
        
        name: "Судогда"
      },
      {
        
        name: "Суздаль"
      },
      {
        
        name: "Юрьев-Польский"
      },
      {
        
        name: "Алексеевская"
      },
      {
        
        name: "Алущевск"
      },
      {
        
        name: "Быково"
      },
      {
        
        name: "Волгоград"
      },
      {
        
        name: "Волжский"
      },
      {
        
        name: "Городище"
      },
      {
        
        name: "Дубовка"
      },
      {
        
        name: "Елань"
      },
      {
        
        name: "Жирновск"
      },
      {
        
        name: "Иловля"
      },
      {
        
        name: "Калач-на-Дону"
      },
      {
        
        name: "Камышин"
      },
      {
        
        name: "Кириллов"
      },
      {
        
        name: "Клетский"
      },
      {
        
        name: "Котельниково"
      },
      {
        
        name: "Котово"
      },
      {
        
        name: "Кумылженская"
      },
      {
        
        name: "Ленинск"
      },
      {
        
        name: "Михайловка"
      },
      {
        
        name: "Нехаевский"
      },
      {
        
        name: "Николаевск"
      },
      {
        
        name: "Новоаннинский"
      },
      {
        
        name: "Новониколаевский"
      },
      {
        
        name: "Ольховка"
      },
      {
        
        name: "Палласовка"
      },
      {
        
        name: "Рудня"
      },
      {
        
        name: "Светлый Яр"
      },
      {
        
        name: "Серафимович"
      },
      {
        
        name: "Средняя Ахтуба"
      },
      {
        
        name: "Сталинград"
      },
      {
        
        name: "Старая Полтавка"
      },
      {
        
        name: "Суровикино"
      },
      {
        
        name: "Урюпинск"
      },
      {
        
        name: "Фролово"
      },
      {
        
        name: "Чернышковский"
      },
      {
        
        name: "Бабаево"
      },
      {
        
        name: "Белозерск"
      },
      {
        
        name: "Великий Устюг"
      },
      {
        
        name: "Верховажье"
      },
      {
        
        name: "Вожега"
      },
      {
        
        name: "Вологда"
      },
      {
        
        name: "Вохтога"
      },
      {
        
        name: "Вытегра"
      },
      {
        
        name: "Грязовец"
      },
      {
        
        name: "Кадников"
      },
      {
        
        name: "Кадуй"
      },
      {
        
        name: "Кичменгский Городок"
      },
      {
        
        name: "Липин Бор"
      },
      {
        
        name: "Никольск"
      },
      {
        
        name: "Нюксеница"
      },
      {
        
        name: "Сокол"
      },
      {
        
        name: "Сямжа"
      },
      {
        
        name: "Тарногский Городок"
      },
      {
        
        name: "Тотьма"
      },
      {
        
        name: "Устюжна"
      },
      {
        
        name: "Харовск"
      },
      {
        
        name: "Чагода"
      },
      {
        
        name: "Череповец"
      },
      {
        
        name: "Шексна"
      },
      {
        
        name: "Шуйское"
      },
      {
        
        name: "Анна"
      },
      {
        
        name: "Бобров"
      },
      {
        
        name: "Богучар"
      },
      {
        
        name: "Борисоглебск"
      },
      {
        
        name: "Бутурлиновка"
      },
      {
        
        name: "Верхний Мамон"
      },
      {
        
        name: "Верхняя Хава"
      },
      {
        
        name: "Воробьевка"
      },
      {
        
        name: "Воронеж"
      },
      {
        
        name: "Грибановский"
      },
      {
        
        name: "Давыдовка"
      },
      {
        
        name: "Елань-Коленовский"
      },
      {
        
        name: "Калач"
      },
      {
        
        name: "Кантемировка"
      },
      {
        
        name: "Лиски"
      },
      {
        
        name: "Нижнедевицк"
      },
      {
        
        name: "Новая Усмань"
      },
      {
        
        name: "Новохоперск"
      },
      {
        
        name: "Ольховатка"
      },
      {
        
        name: "Острогожск"
      },
      {
        
        name: "Павловск"
      },
      {
        
        name: "Панино"
      },
      {
        
        name: "Петропавловка"
      },
      {
        
        name: "Поворино"
      },
      {
        
        name: "Подгоренский"
      },
      {
        
        name: "Рамонь"
      },
      {
        
        name: "Репьевка"
      },
      {
        
        name: "Россошь"
      },
      {
        
        name: "Семилуки"
      },
      {
        
        name: "Таловая"
      },
      {
        
        name: "Терновка"
      },
      {
        
        name: "Хохольский"
      },
      {
        
        name: "Эртиль"
      },
      {
        
        name: "нововоронеж"
      },
      {
        
        name: "Агвали"
      },
      {
        
        name: "Акуша"
      },
      {
        
        name: "Ахты"
      },
      {
        
        name: "Ачису"
      },
      {
        
        name: "Бабаюрт"
      },
      {
        
        name: "Бежта"
      },
      {
        
        name: "Ботлих"
      },
      {
        
        name: "Буйнакск"
      },
      {
        
        name: "Вачи"
      },
      {
        
        name: "Гергебиль"
      },
      {
        
        name: "Гуниб"
      },
      {
        
        name: "Дагестанские Огни"
      },
      {
        
        name: "Дербент"
      },
      {
        
        name: "Дылым"
      },
      {
        
        name: "Ершовка"
      },
      {
        
        name: "Избербаш"
      },
      {
        
        name: "Карабудахкент"
      },
      {
        
        name: "Карата"
      },
      {
        
        name: "Каспийск"
      },
      {
        
        name: "Касумкент"
      },
      {
        
        name: "Кизилюрт"
      },
      {
        
        name: "Кизляр"
      },
      {
        
        name: "Кочубей"
      },
      {
        
        name: "Кумух"
      },
      {
        
        name: "Курах"
      },
      {
        
        name: "Магарамкент"
      },
      {
        
        name: "Маджалис"
      },
      {
        
        name: "Махачкала"
      },
      {
        
        name: "Мехельта"
      },
      {
        
        name: "Новолакское"
      },
      {
        
        name: "Рутул"
      },
      {
        
        name: "Советское"
      },
      {
        
        name: "Тарумовка"
      },
      {
        
        name: "Терекли-Мектеб"
      },
      {
        
        name: "Тлярата"
      },
      {
        
        name: "Тпиг"
      },
      {
        
        name: "Уркарах"
      },
      {
        
        name: "Хасавюрт"
      },
      {
        
        name: "Хив"
      },
      {
        
        name: "Хунзах"
      },
      {
        
        name: "Цуриб"
      },
      {
        
        name: "Южно-Сухокумск"
      },
      {
        
        name: "Биробиджан"
      },
      {
        
        name: "Архиповка"
      },
      {
        
        name: "Верхний Ландех"
      },
      {
        
        name: "Вичуга"
      },
      {
        
        name: "Гаврилов Посад"
      },
      {
        
        name: "Долматовский"
      },
      {
        
        name: "Дуляпино"
      },
      {
        
        name: "Заволжск"
      },
      {
        
        name: "Заречный"
      },
      {
        
        name: "Иваново"
      },
      {
        
        name: "Иваньковский"
      },
      {
        
        name: "Ильинское-Хованское"
      },
      {
        
        name: "Каминский"
      },
      {
        
        name: "Кинешма"
      },
      {
        
        name: "Комсомольск"
      },
      {
        
        name: "Кохма"
      },
      {
        
        name: "Лух"
      },
      {
        
        name: "Палех"
      },
      {
        
        name: "Пестяки"
      },
      {
        
        name: "Приволжск"
      },
      {
        
        name: "Пучеж"
      },
      {
        
        name: "Родники"
      },
      {
        
        name: "Савино"
      },
      {
        
        name: "Сокольское"
      },
      {
        
        name: "Тейково"
      },
      {
        
        name: "Фурманов"
      },
      {
        
        name: "Шуя"
      },
      {
        
        name: "Южа"
      },
      {
        
        name: "Юрьевец"
      },
      {
        
        name: "Алексеевск"
      },
      {
        
        name: "Алзамай"
      },
      {
        
        name: "Алыгжер"
      },
      {
        
        name: "Ангарск"
      },
      {
        
        name: "Артемовский"
      },
      {
        
        name: "Атагай"
      },
      {
        
        name: "Байкал"
      },
      {
        
        name: "Байкальск"
      },
      {
        
        name: "Балаганск"
      },
      {
        
        name: "Баяндай"
      },
      {
        
        name: "Бирюсинск"
      },
      {
        
        name: "Бодайбо"
      },
      {
        
        name: "Большая Речка"
      },
      {
        
        name: "Большой Луг"
      },
      {
        
        name: "Бохан"
      },
      {
        
        name: "Братск"
      },
      {
        
        name: "Видим"
      },
      {
        
        name: "Витимский"
      },
      {
        
        name: "Вихоревка"
      },
      {
        
        name: "Еланцы"
      },
      {
        
        name: "Ербогачен"
      },
      {
        
        name: "Железногорск-Илимский"
      },
      {
        
        name: "Жигалово"
      },
      {
        
        name: "Забитуй"
      },
      {
        
        name: "Залари"
      },
      {
        
        name: "Звездный"
      },
      {
        
        name: "Зима"
      },
      {
        
        name: "Иркутск"
      },
      {
        
        name: "Казачинское"
      },
      {
        
        name: "Качуг"
      },
      {
        
        name: "Квиток"
      },
      {
        
        name: "Киренск"
      },
      {
        
        name: "Куйтун"
      },
      {
        
        name: "Култук"
      },
      {
        
        name: "Кутулик"
      },
      {
        
        name: "Мама"
      },
      {
        
        name: "Нижнеудинск"
      },
      {
        
        name: "Оса"
      },
      {
        
        name: "Саянск"
      },
      {
        
        name: "Слюдянка"
      },
      {
        
        name: "Тайшет"
      },
      {
        
        name: "Тулун"
      },
      {
        
        name: "Усолье-Сибирское"
      },
      {
        
        name: "Усть-Илимск"
      },
      {
        
        name: "Усть-Кут"
      },
      {
        
        name: "Усть-Ордынский"
      },
      {
        
        name: "Усть-Уда"
      },
      {
        
        name: "Черемхово"
      },
      {
        
        name: "Чунский"
      },
      {
        
        name: "Шелехов"
      },
      {
        
        name: "Баксан"
      },
      {
        
        name: "Майский"
      },
      {
        
        name: "Нальчик"
      },
      {
        
        name: "Нарткала"
      },
      {
        
        name: "Прохладный"
      },
      {
        
        name: "Советское"
      },
      {
        
        name: "Терек"
      },
      {
        
        name: "Тырныауз"
      },
      {
        
        name: "Чегем-Первый"
      },
      {
        
        name: "Багратионовск"
      },
      {
        
        name: "Балтийск"
      },
      {
        
        name: "Гвардейск"
      },
      {
        
        name: "Гурьевск"
      },
      {
        
        name: "Гусев"
      },
      {
        
        name: "Железнодорожный"
      },
      {
        
        name: "Зеленоградск"
      },
      {
        
        name: "Знаменск"
      },
      {
        
        name: "Кёнигсберг"
      },
      {
        
        name: "Калининград"
      },
      {
        
        name: "Кенисберг"
      },
      {
        
        name: "Краснознаменск"
      },
      {
        
        name: "Мамоново"
      },
      {
        
        name: "Неман"
      },
      {
        
        name: "Нестеров"
      },
      {
        
        name: "Озерск"
      },
      {
        
        name: "Полесск"
      },
      {
        
        name: "Правдинск"
      },
      {
        
        name: "Светлогорск"
      },
      {
        
        name: "Светлый"
      },
      {
        
        name: "Славск"
      },
      {
        
        name: "Советск"
      },
      {
        
        name: "Черняховск"
      },
      {
        
        name: "Аршань"
      },
      {
        
        name: "Каспийский"
      },
      {
        
        name: "Комсомольский"
      },
      {
        
        name: "Малые Дербеты"
      },
      {
        
        name: "Приютное"
      },
      {
        
        name: "Советское"
      },
      {
        
        name: "Троицкое"
      },
      {
        
        name: "Утта"
      },
      {
        
        name: "Цаган-Аман"
      },
      {
        
        name: "Элиста"
      },
      {
        
        name: "Юста"
      },
      {
        
        name: "Яшалта"
      },
      {
        
        name: "Яшкуль"
      },
      {
        
        name: "Бабынино"
      },
      {
        
        name: "Балабаново"
      },
      {
        
        name: "Барятино"
      },
      {
        
        name: "Белоусово"
      },
      {
        
        name: "Бетлица"
      },
      {
        
        name: "Боровск"
      },
      {
        
        name: "Дугна"
      },
      {
        
        name: "Дудоровский"
      },
      {
        
        name: "Думиничи"
      },
      {
        
        name: "Еленский"
      },
      {
        
        name: "Жиздра"
      },
      {
        
        name: "Износки"
      },
      {
        
        name: "Калуга"
      },
      {
        
        name: "Киров"
      },
      {
        
        name: "Козельск"
      },
      {
        
        name: "Кондрово"
      },
      {
        
        name: "Людиново"
      },
      {
        
        name: "Малоярославец"
      },
      {
        
        name: "Медынь"
      },
      {
        
        name: "Мещовск"
      },
      {
        
        name: "Мосальск"
      },
      {
        
        name: "Обнинск"
      },
      {
        
        name: "Перемышль"
      },
      {
        
        name: "Спас-Деменск"
      },
      {
        
        name: "Сухиничи"
      },
      {
        
        name: "Таруса"
      },
      {
        
        name: "Ульяново"
      },
      {
        
        name: "Ферзиково"
      },
      {
        
        name: "Хвастовичи"
      },
      {
        
        name: "Юхнов"
      },
      {
        
        name: "Атласово"
      },
      {
        
        name: "Аянка"
      },
      {
        
        name: "Большерецк"
      },
      {
        
        name: "Вилючинск"
      },
      {
        
        name: "Елизово"
      },
      {
        
        name: "Ильпырский"
      },
      {
        
        name: "Каменское"
      },
      {
        
        name: "Кировский"
      },
      {
        
        name: "Ключи"
      },
      {
        
        name: "Крапивная"
      },
      {
        
        name: "Мильково"
      },
      {
        
        name: "Никольское"
      },
      {
        
        name: "Озерновский"
      },
      {
        
        name: "Оссора"
      },
      {
        
        name: "Палана"
      },
      {
        
        name: "Парень"
      },
      {
        
        name: "Пахачи"
      },
      {
        
        name: "Петропавловск-Камчатский"
      },
      {
        
        name: "Тигиль"
      },
      {
        
        name: "Тиличики"
      },
      {
        
        name: "Усть-Большерецк"
      },
      {
        
        name: "Усть-Камчатск"
      },
      {
        
        name: "Амбарный"
      },
      {
        
        name: "Беломорск"
      },
      {
        
        name: "Валаам"
      },
      {
        
        name: "Вирандозеро"
      },
      {
        
        name: "Гирвас"
      },
      {
        
        name: "Деревянка"
      },
      {
        
        name: "Идель"
      },
      {
        
        name: "Ильинский"
      },
      {
        
        name: "Импалахти"
      },
      {
        
        name: "Калевала"
      },
      {
        
        name: "Кемь"
      },
      {
        
        name: "Кестеньга"
      },
      {
        
        name: "Кондопога"
      },
      {
        
        name: "Костомукша"
      },
      {
        
        name: "Лахденпохья"
      },
      {
        
        name: "Лоухи"
      },
      {
        
        name: "Медвежьегорск"
      },
      {
        
        name: "Муезерский"
      },
      {
        
        name: "Олонец"
      },
      {
        
        name: "Петрозаводск"
      },
      {
        
        name: "Питкяранта"
      },
      {
        
        name: "Повенец"
      },
      {
        
        name: "Пряжа"
      },
      {
        
        name: "Пудож"
      },
      {
        
        name: "Сегежа"
      },
      {
        
        name: "Сортавала"
      },
      {
        
        name: "Софпорог"
      },
      {
        
        name: "Суоярви"
      },
      {
       
        name: "Анжеро-Судженск"
      },
      {
       
        name: "Барзас"
      },
      {
       
        name: "Белово"
      },
      {
       
        name: "Белогорск"
      },
      {
       
        name: "Березовский"
      },
      {
       
        name: "Грамотеино"
      },
      {
       
        name: "Гурьевск"
      },
      {
       
        name: "Ижморский"
      },
      {
       
        name: "Итатский"
      },
      {
       
        name: "Калтан"
      },
      {
       
        name: "Кедровка"
      },
      {
       
        name: "Кемерово"
      },
      {
       
        name: "Киселевск"
      },
      {
       
        name: "Крапивинский"
      },
      {
       
        name: "Ленинск-Кузнецкий"
      },
      {
       
        name: "Мариинск"
      },
      {
       
        name: "Междуреченск"
      },
      {
       
        name: "Мыски"
      },
      {
       
        name: "Новокузнецк"
      },
      {
       
        name: "Осинники"
      },
      {
       
        name: "Прокопьевск"
      },
      {
       
        name: "Промышленная"
      },
      {
       
        name: "Тайга"
      },
      {
       
        name: "Таштагол"
      },
      {
       
        name: "Тисуль"
      },
      {
       
        name: "Топки"
      },
      {
       
        name: "Тяжинский"
      },
      {
       
        name: "Юрга"
      },
      {
       
        name: "Яшкино"
      },
      {
       
        name: "Яя"
      },
      {
        
        name: "Арбаж"
      },
      {
        
        name: "Аркуль"
      },
      {
        
        name: "Белая Холуница"
      },
      {
        
        name: "Богородское"
      },
      {
        
        name: "Боровой"
      },
      {
        
        name: "Верхошижемье"
      },
      {
        
        name: "Вятские Поляны"
      },
      {
        
        name: "Зуевка"
      },
      {
        
        name: "Каринторф"
      },
      {
        
        name: "Кикнур"
      },
      {
        
        name: "Кильмезь"
      },
      {
        
        name: "Киров"
      },
      {
        
        name: "Кирово-Чепецк"
      },
      {
        
        name: "Кирс"
      },
      {
        
        name: "Кобра"
      },
      {
        
        name: "Котельнич"
      },
      {
        
        name: "Кумены"
      },
      {
        
        name: "Ленинское"
      },
      {
        
        name: "Луза"
      },
      {
        
        name: "Малмыж"
      },
      {
        
        name: "Мураши"
      },
      {
        
        name: "Нагорск"
      },
      {
        
        name: "Нема"
      },
      {
        
        name: "Нововятск"
      },
      {
        
        name: "Нолинск"
      },
      {
        
        name: "Омутнинск"
      },
      {
        
        name: "Опарино"
      },
      {
        
        name: "Оричи"
      },
      {
        
        name: "Пижанка"
      },
      {
        
        name: "Подосиновец"
      },
      {
        
        name: "Санчурск"
      },
      {
        
        name: "Свеча"
      },
      {
        
        name: "Слободской"
      },
      {
        
        name: "Советск"
      },
      {
        
        name: "Суна"
      },
      {
        
        name: "Тужа"
      },
      {
        
        name: "Уни"
      },
      {
        
        name: "Уржум"
      },
      {
        
        name: "Фаленки"
      },
      {
        
        name: "Халтурин"
      },
      {
        
        name: "Юрья"
      },
      {
        
        name: "Яранск"
      },
      {
        
        name: "Абезь"
      },
      {
        
        name: "Айкино"
      },
      {
        
        name: "Верхняя Инта"
      },
      {
        
        name: "Визинга"
      },
      {
        
        name: "Водный"
      },
      {
        
        name: "Вожаель"
      },
      {
        
        name: "Воркута"
      },
      {
        
        name: "Вуктыл"
      },
      {
        
        name: "Гешарт"
      },
      {
        
        name: "Елецкий"
      },
      {
        
        name: "Емва"
      },
      {
        
        name: "Заполярный"
      },
      {
        
        name: "Ижма"
      },
      {
        
        name: "Инта"
      },
      {
        
        name: "Ираель"
      },
      {
        
        name: "Каджером"
      },
      {
        
        name: "Кажым"
      },
      {
        
        name: "Кожым"
      },
      {
        
        name: "Койгородок"
      },
      {
        
        name: "Корткерос"
      },
      {
        
        name: "Кослан"
      },
      {
        
        name: "Объячево"
      },
      {
        
        name: "Печора"
      },
      {
        
        name: "Сосногорск"
      },
      {
        
        name: "Сыктывкар"
      },
      {
        
        name: "Троицко-Печерск"
      },
      {
        
        name: "Усинск"
      },
      {
        
        name: "Усогорск"
      },
      {
        
        name: "Усть-Кулом"
      },
      {
        
        name: "Усть-Цильма"
      },
      {
        
        name: "Ухта"
      },
      {
        
        name: "Антропово"
      },
      {
        
        name: "Боговарово"
      },
      {
        
        name: "Буй"
      },
      {
        
        name: "Волгореченск"
      },
      {
        
        name: "Галич"
      },
      {
        
        name: "Горчуха"
      },
      {
        
        name: "Зебляки"
      },
      {
        
        name: "Кадый"
      },
      {
        
        name: "Кологрив"
      },
      {
        
        name: "Кострома"
      },
      {
        
        name: "Красное-на-Волге"
      },
      {
        
        name: "Макарьев"
      },
      {
        
        name: "Мантурово"
      },
      {
        
        name: "Нерехта"
      },
      {
        
        name: "Нея"
      },
      {
        
        name: "Островское"
      },
      {
        
        name: "Павино"
      },
      {
        
        name: "Парфентьево"
      },
      {
        
        name: "Поназырево"
      },
      {
        
        name: "Солигалич"
      },
      {
        
        name: "Судиславль"
      },
      {
        
        name: "Сусанино"
      },
      {
        
        name: "Чухлома"
      },
      {
        
        name: "Шарья"
      },
      {
        
        name: "Шемятино"
      },
      {
        
        name: "Абинск"
      },
      {
        
        name: "Абрау-Дюрсо"
      },
      {
        
        name: "Анапа"
      },
      {
        
        name: "Апшеронск"
      },
      {
        
        name: "Армавир"
      },
      {
        
        name: "Архипо-Осиповка"
      },
      {
        
        name: "Афипский"
      },
      {
        
        name: "Ахтырский"
      },
      {
        
        name: "Ачуево"
      },
      {
        
        name: "Белореченск"
      },
      {
        
        name: "Верхнебаканский"
      },
      {
        
        name: "Выселки"
      },
      {
        
        name: "Геленджик"
      },
      {
        
        name: "Гиагинская"
      },
      {
        
        name: "Горячий Ключ"
      },
      {
        
        name: "Джубга"
      },
      {
        
        name: "Динская"
      },
      {
        
        name: "Ейск"
      },
      {
        
        name: "Ильский"
      },
      {
        
        name: "Кабардинка"
      },
      {
        
        name: "Калинино"
      },
      {
        
        name: "Калининская"
      },
      {
        
        name: "Каменномостский"
      },
      {
        
        name: "Каневская"
      },
      {
        
        name: "Кореновск"
      },
      {
        
        name: "Красноармейская"
      },
      {
        
        name: "Краснодар"
      },
      {
        
        name: "Кропоткин"
      },
      {
        
        name: "Крыловская"
      },
      {
        
        name: "Крымск"
      },
      {
        
        name: "Курганинск"
      },
      {
        
        name: "Кущевская"
      },
      {
        
        name: "Лабинск"
      },
      {
        
        name: "Лениградская"
      },
      {
        
        name: "Майкоп"
      },
      {
        
        name: "Мостовской"
      },
      {
        
        name: "Новороссийск"
      },
      {
        
        name: "Отрадная"
      },
      {
        
        name: "Павловская"
      },
      {
        
        name: "Приморско-Ахтарск"
      },
      {
        
        name: "Северская"
      },
      {
        
        name: "Славянск-на-Кубани"
      },
      {
        
        name: "Сочи"
      },
      {
        
        name: "Староминская"
      },
      {
        
        name: "Старощербиновская"
      },
      {
        
        name: "Тбилисская"
      },
      {
        
        name: "Темрюк"
      },
      {
        
        name: "Тимашевск"
      },
      {
        
        name: "Тихорецк"
      },
      {
        
        name: "Туапсе"
      },
      {
        
        name: "Тульский"
      },
      {
        
        name: "Усть-Лабинск"
      },
      {
        
        name: "Шовгеновский"
      },
      {
        
        name: " Железногорск"
      },
      {
        
        name: "Абаза"
      },
      {
        
        name: "Абакан"
      },
      {
        
        name: "Абан"
      },
      {
        
        name: "Агинское"
      },
      {
        
        name: "Артемовск"
      },
      {
        
        name: "Аскиз"
      },
      {
        
        name: "Ачинск"
      },
      {
        
        name: "Байкит"
      },
      {
        
        name: "Балахта"
      },
      {
        
        name: "Балыкса"
      },
      {
        
        name: "Белый Яр"
      },
      {
        
        name: "Бельтырский"
      },
      {
        
        name: "Бея"
      },
      {
        
        name: "Бискамжа"
      },
      {
        
        name: "Боготол"
      },
      {
        
        name: "Боград"
      },
      {
        
        name: "Богучаны"
      },
      {
        
        name: "Большая Мурта"
      },
      {
        
        name: "Большой Улуй"
      },
      {
        
        name: "Бородино"
      },
      {
        
        name: "Ванавара"
      },
      {
        
        name: "Верхнеимбатск"
      },
      {
        
        name: "Горячегорск"
      },
      {
        
        name: "Дзержинское"
      },
      {
        
        name: "Дивногорск"
      },
      {
        
        name: "Диксон"
      },
      {
        
        name: "Дудинка"
      },
      {
        
        name: "Емельяново"
      },
      {
        
        name: "Енисейск"
      },
      {
        
        name: "Ермаковское"
      },
      {
        
        name: "Заозерный"
      },
      {
        
        name: "Зеленогорск"
      },
      {
        
        name: "Игарка"
      },
      {
        
        name: "Идринское"
      },
      {
        
        name: "Иланский"
      },
      {
        
        name: "Ирбейское"
      },
      {
        
        name: "Казачинское"
      },
      {
        
        name: "Канск"
      },
      {
        
        name: "Каратузское"
      },
      {
        
        name: "Караул"
      },
      {
        
        name: "Кежма"
      },
      {
        
        name: "Кодинск"
      },
      {
        
        name: "Козулька"
      },
      {
        
        name: "Копьево"
      },
      {
        
        name: "Краснотуранск"
      },
      {
        
        name: "Красноярск"
      },
      {
        
        name: "Курагино"
      },
      {
        
        name: "Лесосибирск"
      },
      {
        
        name: "Минусинск"
      },
      {
        
        name: "Мотыгино"
      },
      {
        
        name: "Назарово"
      },
      {
        
        name: "Нижний Ингаш"
      },
      {
        
        name: "Новоселово"
      },
      {
        
        name: "Норильск"
      },
      {
        
        name: "Партизанское"
      },
      {
        
        name: "Пировское"
      },
      {
        
        name: "Саяногорск"
      },
      {
        
        name: "Северо-Енисейский"
      },
      {
        
        name: "Сосновоборск"
      },
      {
        
        name: "Тасеево"
      },
      {
        
        name: "Таштып"
      },
      {
        
        name: "Тура"
      },
      {
        
        name: "Туруханск"
      },
      {
        
        name: "Тюхтет"
      },
      {
        
        name: "Ужур"
      },
      {
        
        name: "Усть-Авам"
      },
      {
        
        name: "Уяр"
      },
      {
        
        name: "Хатанга"
      },
      {
        
        name: "Черемушки"
      },
      {
        
        name: "Черногорск"
      },
      {
        
        name: "Шалинское"
      },
      {
        
        name: "Шарыпово"
      },
      {
        
        name: "Шира"
      },
      {
        
        name: "Шушенское"
      },
      {
        
        name: "Варгаши"
      },
      {
        
        name: "Глядянское"
      },
      {
        
        name: "Далматово"
      },
      {
        
        name: "Каргаполье"
      },
      {
        
        name: "Катайск"
      },
      {
        
        name: "Кетово"
      },
      {
        
        name: "Курган"
      },
      {
        
        name: "Куртамыш"
      },
      {
        
        name: "Лебяжье"
      },
      {
        
        name: "Макушино"
      },
      {
        
        name: "Мишкино"
      },
      {
        
        name: "Мокроусово"
      },
      {
        
        name: "Петухово"
      },
      {
        
        name: "Половинное"
      },
      {
        
        name: "Сафакулево"
      },
      {
        
        name: "Целинное"
      },
      {
        
        name: "Шадринск"
      },
      {
        
        name: "Шатрово"
      },
      {
        
        name: "Шумиха"
      },
      {
        
        name: "Щучье"
      },
      {
        
        name: "Юргамыш"
      },
      {
        
        name: "Альменево"
      },
      {
        
        name: "Белая"
      },
      {
        
        name: "Большое Солдатское"
      },
      {
        
        name: "Глушково"
      },
      {
        
        name: "Горшечное"
      },
      {
        
        name: "Дмитриев-Льговский"
      },
      {
        
        name: "Железногорск"
      },
      {
        
        name: "Золотухино"
      },
      {
        
        name: "Касторное"
      },
      {
        
        name: "Конышевка"
      },
      {
        
        name: "Коренево"
      },
      {
        
        name: "Курск"
      },
      {
        
        name: "Курчатов"
      },
      {
        
        name: "Кшенский"
      },
      {
        
        name: "Льгов"
      },
      {
        
        name: "Мантурово"
      },
      {
        
        name: "Медвенка"
      },
      {
        
        name: "Обоянь"
      },
      {
        
        name: "Поныри"
      },
      {
        
        name: "Пристень"
      },
      {
        
        name: "Прямицыно"
      },
      {
        
        name: "Рыльск"
      },
      {
        
        name: "Суджа"
      },
      {
        
        name: "Тим"
      },
      {
        
        name: "Фатеж"
      },
      {
        
        name: "Хомутовка"
      },
      {
        
        name: "Черемисиново"
      },
      {
        
        name: "Щигры"
      },
      {
        
        name: "Грязи"
      },
      {
        
        name: "Данхов"
      },
      {
        
        name: "Доброе"
      },
      {
        
        name: "Долгоруково"
      },
      {
        
        name: "Елец"
      },
      {
        
        name: "Задонск"
      },
      {
        
        name: "Измалково"
      },
      {
        
        name: "Казинка"
      },
      {
        
        name: "Лебедянь"
      },
      {
        
        name: "Лев Толстой"
      },
      {
        
        name: "Липецк"
      },
      {
        
        name: "Тербуны"
      },
      {
        
        name: "Усмань"
      },
      {
        
        name: "Хлевное"
      },
      {
        
        name: "Чаплыгин"
      },
      {
        
        name: "Анадырь"
      },
      {
        
        name: "Атка"
      },
      {
        
        name: "Балыгычан"
      },
      {
        
        name: "Беринговский"
      },
      {
        
        name: "Билибино"
      },
      {
        
        name: "Большевик"
      },
      {
        
        name: "Ванкарем"
      },
      {
        
        name: "Иульитин"
      },
      {
        
        name: "Кадыкчан"
      },
      {
        
        name: "Лаврентия"
      },
      {
        
        name: "Магадан"
      },
      {
        
        name: "Мыс Шмидта"
      },
      {
        
        name: "Ола"
      },
      {
        
        name: "Омонск"
      },
      {
        
        name: "Омсукчан"
      },
      {
        
        name: "Палатка"
      },
      {
        
        name: "Певек"
      },
      {
        
        name: "Провидения"
      },
      {
        
        name: "Сеймчан"
      },
      {
        
        name: "Синегорье"
      },
      {
        
        name: "Сусуман"
      },
      {
        
        name: "Усть-Белая"
      },
      {
        
        name: "Усть-Омчуг"
      },
      {
        
        name: "Эвенск"
      },
      {
        
        name: "Эгвекинот"
      },
      {
        
        name: "Ягодное"
      },
      {
        
        name: "Волжск"
      },
      {
        
        name: "Дубовский"
      },
      {
        
        name: "Звенигово"
      },
      {
        
        name: "Йошкар-Ола"
      },
      {
        
        name: "Килемары"
      },
      {
        
        name: "Козьмодемьянск"
      },
      {
        
        name: "Куженер"
      },
      {
        
        name: "Мари-Турек"
      },
      {
        
        name: "Медведево"
      },
      {
        
        name: "Морки"
      },
      {
        
        name: "Новый Торьял"
      },
      {
        
        name: "Оршанка"
      },
      {
        
        name: "Параньга"
      },
      {
        
        name: "Сернур"
      },
      {
        
        name: "Советский"
      },
      {
        
        name: "Юрино"
      },
      {
        
        name: "Ардатов"
      },
      {
        
        name: "Атюрьево"
      },
      {
        
        name: "Атяшево"
      },
      {
        
        name: "Большие Березники"
      },
      {
        
        name: "Большое Игнатово"
      },
      {
        
        name: "Выша"
      },
      {
        
        name: "Ельники"
      },
      {
        
        name: "Зубова Поляна"
      },
      {
        
        name: "Инсар"
      },
      {
        
        name: "Кадошкино"
      },
      {
        
        name: "Кемля"
      },
      {
        
        name: "Ковылкино"
      },
      {
        
        name: "Комсомольский"
      },
      {
        
        name: "Кочкурово"
      },
      {
        
        name: "Краснослободск"
      },
      {
        
        name: "Лямбирь"
      },
      {
        
        name: "Ромоданово"
      },
      {
        
        name: "Рузаевка"
      },
      {
        
        name: "Саранск"
      },
      {
        
        name: "Старое Шайгово"
      },
      {
        
        name: "Темников"
      },
      {
        
        name: "Теньгушево"
      },
      {
        
        name: "Торбеево"
      },
      {
        
        name: "Чамзинка"
      },
      {
        
        name: "Апатиты"
      },
      {
        
        name: "Африканда"
      },
      {
        
        name: "Верхнетуломский"
      },
      {
        
        name: "Заозерск"
      },
      {
        
        name: "Заполярный"
      },
      {
        
        name: "Зареченск"
      },
      {
        
        name: "Зашеек"
      },
      {
        
        name: "Зеленоборский"
      },
      {
        
        name: "Кандалакша"
      },
      {
        
        name: "Кильдинстрой"
      },
      {
        
        name: "Кировск"
      },
      {
        
        name: "Ковдор"
      },
      {
        
        name: "Кола"
      },
      {
        
        name: "Конда"
      },
      {
        
        name: "Мончегорск"
      },
      {
        
        name: "Мурманск"
      },
      {
        
        name: "Мурмаши"
      },
      {
        
        name: "Никель"
      },
      {
        
        name: "Оленегорск"
      },
      {
        
        name: "Полярные Зори"
      },
      {
        
        name: "Полярный"
      },
      {
        
        name: "Североморск"
      },
      {
        
        name: "Снежногорск"
      },
      {
        
        name: "Умба"
      },
      {
        
        name: "Ардатов"
      },
      {
        
        name: "Арзамас"
      },
      {
        
        name: "Арья"
      },
      {
        
        name: "Балахна"
      },
      {
        
        name: "Богородск"
      },
      {
        
        name: "Большереченск"
      },
      {
        
        name: "Большое Болдино"
      },
      {
        
        name: "Большое Козино"
      },
      {
        
        name: "Большое Мурашкино"
      },
      {
        
        name: "Большое Пикино"
      },
      {
        
        name: "Бор"
      },
      {
        
        name: "Бутурлино"
      },
      {
        
        name: "Вад"
      },
      {
        
        name: "Варнавино"
      },
      {
        
        name: "Васильсурск"
      },
      {
        
        name: "Вахтан"
      },
      {
        
        name: "Вача"
      },
      {
        
        name: "Велетьма"
      },
      {
        
        name: "Ветлуга"
      },
      {
        
        name: "Виля"
      },
      {
        
        name: "Вознесенское"
      },
      {
        
        name: "Володарск"
      },
      {
        
        name: "Воротынец"
      },
      {
        
        name: "Ворсма"
      },
      {
        
        name: "Воскресенское"
      },
      {
        
        name: "Выездное"
      },
      {
        
        name: "Выкса"
      },
      {
        
        name: "Гагино"
      },
      {
        
        name: "Гидроторф"
      },
      {
        
        name: "Горбатов"
      },
      {
        
        name: "Горбатовка"
      },
      {
        
        name: "Городец"
      },
      {
        
        name: "Горький"
      },
      {
        
        name: "Дальнее Константиново"
      },
      {
        
        name: "Дзержинск"
      },
      {
        
        name: "Дивеево"
      },
      {
        
        name: "Досчатое"
      },
      {
        
        name: "Заволжье"
      },
      {
        
        name: "Катунки"
      },
      {
        
        name: "Керженец"
      },
      {
        
        name: "Княгинино"
      },
      {
        
        name: "Ковернино"
      },
      {
        
        name: "Красные Баки"
      },
      {
        
        name: "Кстово"
      },
      {
        
        name: "Кулебаки"
      },
      {
        
        name: "Лукоянов"
      },
      {
        
        name: "Лысково"
      },
      {
        
        name: "Навашино"
      },
      {
        
        name: "Нижний Новгород"
      },
      {
        
        name: "Павлово"
      },
      {
        
        name: "Первомайск"
      },
      {
        
        name: "Перевоз"
      },
      {
        
        name: "Пильна"
      },
      {
        
        name: "Починки"
      },
      {
        
        name: "Саров"
      },
      {
        
        name: "Сергач"
      },
      {
        
        name: "Сеченово"
      },
      {
        
        name: "Сосновское"
      },
      {
        
        name: "Спасское"
      },
      {
        
        name: "Тонкино"
      },
      {
        
        name: "Тоншаево"
      },
      {
        
        name: "Уразовка"
      },
      {
        
        name: "Урень"
      },
      {
        
        name: "Чкаловск"
      },
      {
        
        name: "Шаранга"
      },
      {
        
        name: "Шатки"
      },
      {
        
        name: "Шахунья"
      },
      {
        
        name: "Анциферово"
      },
      {
        
        name: "Батецкий"
      },
      {
        
        name: "Большая Вишера"
      },
      {
        
        name: "Боровичи"
      },
      {
        
        name: "Валдай"
      },
      {
        
        name: "Волот"
      },
      {
        
        name: "Деманск"
      },
      {
        
        name: "Зарубино"
      },
      {
        
        name: "Кресцы"
      },
      {
        
        name: "Любытино"
      },
      {
        
        name: "Малая Вишера"
      },
      {
        
        name: "Марево"
      },
      {
        
        name: "Мошенское"
      },
      {
        
        name: "Новгород"
      },
      {
        
        name: "Окуловка"
      },
      {
        
        name: "Парфино"
      },
      {
        
        name: "Пестово"
      },
      {
        
        name: "Поддорье"
      },
      {
        
        name: "Сольцы"
      },
      {
        
        name: "Старая Русса"
      },
      {
        
        name: "Хвойное"
      },
      {
        
        name: "Холм"
      },
      {
        
        name: "Чудово"
      },
      {
        
        name: "Шимск"
      },
      {
        
        name: "Баган"
      },
      {
        
        name: "Барабинск"
      },
      {
        
        name: "Бердск"
      },
      {
        
        name: "Биаза"
      },
      {
        
        name: "Болотное"
      },
      {
        
        name: "Венгерово"
      },
      {
        
        name: "Довольное"
      },
      {
        
        name: "Завьялово"
      },
      {
        
        name: "Искитим"
      },
      {
        
        name: "Карасук"
      },
      {
        
        name: "Каргат"
      },
      {
        
        name: "Колывань"
      },
      {
        
        name: "Краснозерское"
      },
      {
        
        name: "Крутиха"
      },
      {
        
        name: "Куйбышев"
      },
      {
        
        name: "Купино"
      },
      {
        
        name: "Кыштовка"
      },
      {
        
        name: "Маслянино"
      },
      {
        
        name: "Михайловский"
      },
      {
        
        name: "Мошково"
      },
      {
        
        name: "Новосибирск"
      },
      {
        
        name: "Ордынское"
      },
      {
        
        name: "Северное"
      },
      {
        
        name: "Сузун"
      },
      {
        
        name: "Татарск"
      },
      {
        
        name: "Тогучин"
      },
      {
        
        name: "Убинское"
      },
      {
        
        name: "Усть-Тарка"
      },
      {
        
        name: "Чаны"
      },
      {
        
        name: "Черепаново"
      },
      {
        
        name: "Чистоозерное"
      },
      {
        
        name: "Чулым"
      },
      {
        
        name: "Береговой"
      },
      {
        
        name: "Большеречье"
      },
      {
        
        name: "Большие Уки"
      },
      {
        
        name: "Горьковское"
      },
      {
        
        name: "Знаменское"
      },
      {
        
        name: "Исилькуль"
      },
      {
        
        name: "Калачинск"
      },
      {
        
        name: "Колосовка"
      },
      {
        
        name: "Кормиловка"
      },
      {
        
        name: "Крутинка"
      },
      {
        
        name: "Любинский"
      },
      {
        
        name: "Марьяновка"
      },
      {
        
        name: "Муромцево"
      },
      {
        
        name: "Называевск"
      },
      {
        
        name: "Нижняя Омка"
      },
      {
        
        name: "Нововаршавка"
      },
      {
        
        name: "Одесское"
      },
      {
        
        name: "Оконешниково"
      },
      {
        
        name: "Омск"
      },
      {
        
        name: "Павлоградка"
      },
      {
        
        name: "Полтавка"
      },
      {
        
        name: "Русская Поляна"
      },
      {
        
        name: "Саргатское"
      },
      {
        
        name: "Седельниково"
      },
      {
        
        name: "Таврическое"
      },
      {
        
        name: "Тара"
      },
      {
        
        name: "Тевриз"
      },
      {
        
        name: "Тюкалинск"
      },
      {
        
        name: "Усть-Ишим"
      },
      {
        
        name: "Черлак"
      },
      {
        
        name: "Шербакуль"
      },
      {
        
        name: "Абдулино"
      },
      {
        
        name: "Адамовка"
      },
      {
        
        name: "Айдырлинский"
      },
      {
        
        name: "Акбулак"
      },
      {
        
        name: "Аккермановка"
      },
      {
        
        name: "Асекеево"
      },
      {
        
        name: "Беляевка"
      },
      {
        
        name: "Бугуруслан"
      },
      {
        
        name: "Бузулук"
      },
      {
        
        name: "Гай"
      },
      {
        
        name: "Грачевка"
      },
      {
        
        name: "Домбаровский"
      },
      {
        
        name: "Дубенский"
      },
      {
        
        name: "Илек"
      },
      {
        
        name: "Ириклинский"
      },
      {
        
        name: "Кувандык"
      },
      {
        
        name: "Курманаевка"
      },
      {
        
        name: "Матвеевка"
      },
      {
        
        name: "Медногорск"
      },
      {
        
        name: "Новоорск"
      },
      {
        
        name: "Новосергиевка"
      },
      {
        
        name: "Новотроицк"
      },
      {
        
        name: "Октябрьское"
      },
      {
        
        name: "Оренбург"
      },
      {
        
        name: "Орск"
      },
      {
        
        name: "Первомайский"
      },
      {
        
        name: "Переволоцкий"
      },
      {
        
        name: "Пономаревка"
      },
      {
        
        name: "Саракташ"
      },
      {
        
        name: "Светлый"
      },
      {
        
        name: "Северное"
      },
      {
        
        name: "Соль-Илецк"
      },
      {
        
        name: "Сорочинск"
      },
      {
        
        name: "Ташла"
      },
      {
        
        name: "Тоцкое"
      },
      {
        
        name: "Тюльган"
      },
      {
        
        name: "Шарлык"
      },
      {
        
        name: "Энергетик"
      },
      {
        
        name: "Ясный"
      },
      {
        
        name: "Болхов"
      },
      {
        
        name: "Верховье"
      },
      {
        
        name: "Глазуновка"
      },
      {
        
        name: "Дмитровск-Орловский"
      },
      {
        
        name: "Долгое"
      },
      {
        
        name: "Залегощь"
      },
      {
        
        name: "Змиевка"
      },
      {
        
        name: "Знаменское"
      },
      {
        
        name: "Колпны"
      },
      {
        
        name: "Красная Заря"
      },
      {
        
        name: "Кромы"
      },
      {
        
        name: "Ливны"
      },
      {
        
        name: "Малоархангельск"
      },
      {
        
        name: "Мценск"
      },
      {
        
        name: "Нарышкино"
      },
      {
        
        name: "Новосиль"
      },
      {
        
        name: "Орел"
      },
      {
        
        name: "Покровское"
      },
      {
        
        name: "Сосково"
      },
      {
        
        name: "Тросна"
      },
      {
        
        name: "Хомутово"
      },
      {
        
        name: "Хотынец"
      },
      {
        
        name: "Шаблыкино"
      },
      {
        
        name: "Башмаково"
      },
      {
        
        name: "Беднодемьяновск"
      },
      {
        
        name: "Беково"
      },
      {
        
        name: "Белинский"
      },
      {
        
        name: "Бессоновка"
      },
      {
        
        name: "Вадинск"
      },
      {
        
        name: "Верхозим"
      },
      {
        
        name: "Городище"
      },
      {
        
        name: "Евлашево"
      },
      {
        
        name: "Земетчино"
      },
      {
        
        name: "Золотаревка"
      },
      {
        
        name: "Исса"
      },
      {
        
        name: "Каменка"
      },
      {
        
        name: "Колышлей"
      },
      {
        
        name: "Кондоль"
      },
      {
        
        name: "Кузнецк"
      },
      {
        
        name: "Лопатино"
      },
      {
        
        name: "Малая Сердоба"
      },
      {
        
        name: "Мокшан"
      },
      {
        
        name: "Наровчат"
      },
      {
        
        name: "Неверкино"
      },
      {
        
        name: "Нижний Ломов"
      },
      {
        
        name: "Никольск"
      },
      {
        
        name: "Пачелма"
      },
      {
        
        name: "Пенза"
      },
      {
        
        name: "Русский Камешкир"
      },
      {
        
        name: "Сердобск"
      },
      {
        
        name: "Сосновоборск"
      },
      {
        
        name: "Сура"
      },
      {
        
        name: "Тамала"
      },
      {
        
        name: "Шемышейка"
      },
      {
        
        name: "Барда"
      },
      {
        
        name: "Березники"
      },
      {
        
        name: "Большая Соснова"
      },
      {
        
        name: "Верещагино"
      },
      {
        
        name: "Гайны"
      },
      {
        
        name: "Горнозаводск"
      },
      {
        
        name: "Гремячинск"
      },
      {
        
        name: "Губаха"
      },
      {
        
        name: "Добрянка"
      },
      {
        
        name: "Елово"
      },
      {
        
        name: "Зюкайка"
      },
      {
        
        name: "Ильинский"
      },
      {
        
        name: "Карагай"
      },
      {
        
        name: "Керчевский"
      },
      {
        
        name: "Кизел"
      },
      {
        
        name: "Коса"
      },
      {
        
        name: "Кочево"
      },
      {
        
        name: "Красновишерск"
      },
      {
        
        name: "Краснокамск"
      },
      {
        
        name: "Кудымкар"
      },
      {
        
        name: "Куеда"
      },
      {
        
        name: "Кунгур"
      },
      {
        
        name: "Лысьва"
      },
      {
        
        name: "Ныроб"
      },
      {
        
        name: "Нытва"
      },
      {
        
        name: "Октябрьский"
      },
      {
        
        name: "Орда"
      },
      {
        
        name: "Оса"
      },
      {
        
        name: "Оханск"
      },
      {
        
        name: "Очер"
      },
      {
        
        name: "Пермь"
      },
      {
        
        name: "Соликамск"
      },
      {
        
        name: "Суксун"
      },
      {
        
        name: "Уинское"
      },
      {
        
        name: "Усолье"
      },
      {
        
        name: "Усть-Кишерть"
      },
      {
        
        name: "Чайковский"
      },
      {
        
        name: "Частые"
      },
      {
        
        name: "Чердынь"
      },
      {
        
        name: "Чернореченский"
      },
      {
        
        name: "Чернушка"
      },
      {
        
        name: "Чусовой"
      },
      {
        
        name: "Юрла"
      },
      {
        
        name: "Юсьва"
      },
      {
        
        name: "Анучино"
      },
      {
        
        name: "Арсеньев"
      },
      {
        
        name: "Артем"
      },
      {
        
        name: "Артемовский"
      },
      {
        
        name: "Большой Камень"
      },
      {
        
        name: "Валентин"
      },
      {
        
        name: "Владивосток"
      },
      {
        
        name: "Высокогорск"
      },
      {
        
        name: "Горные Ключи"
      },
      {
        
        name: "Горный"
      },
      {
        
        name: "Дальнегорск"
      },
      {
        
        name: "Дальнереченск"
      },
      {
        
        name: "Зарубино"
      },
      {
        
        name: "Кавалерово"
      },
      {
        
        name: "Каменка"
      },
      {
        
        name: "Камень-Рыболов"
      },
      {
        
        name: "Кировский"
      },
      {
        
        name: "Лазо"
      },
      {
        
        name: "Лесозаводск"
      },
      {
        
        name: "Лучегорск"
      },
      {
        
        name: "Михайловка"
      },
      {
        
        name: "Находка"
      },
      {
        
        name: "Новопокровка"
      },
      {
        
        name: "Ольга"
      },
      {
        
        name: "Партизанск"
      },
      {
        
        name: "Пограничный"
      },
      {
        
        name: "Покровка"
      },
      {
        
        name: "Русский"
      },
      {
        
        name: "Самарга"
      },
      {
        
        name: "Славянка"
      },
      {
        
        name: "Спасск-Дальний"
      },
      {
        
        name: "Терней"
      },
      {
        
        name: "Уссурийск"
      },
      {
        
        name: "Фокино"
      },
      {
        
        name: "Хасан"
      },
      {
        
        name: "Хороль"
      },
      {
        
        name: "Черниговка"
      },
      {
        
        name: "Чугуевка"
      },
      {
        
        name: "Яковлевка"
      },
      {
        
        name: "Бежаницы"
      },
      {
        
        name: "Великие Луки"
      },
      {
        
        name: "Гдов"
      },
      {
        
        name: "Дедовичи"
      },
      {
        
        name: "Дно"
      },
      {
        
        name: "Заплюсье"
      },
      {
        
        name: "Идрица"
      },
      {
        
        name: "Красногородское"
      },
      {
        
        name: "Кунья"
      },
      {
        
        name: "Локня"
      },
      {
        
        name: "Невель"
      },
      {
        
        name: "Новоржев"
      },
      {
        
        name: "Новосокольники"
      },
      {
        
        name: "Опочка"
      },
      {
        
        name: "Остров"
      },
      {
        
        name: "Палкино"
      },
      {
        
        name: "Печоры"
      },
      {
        
        name: "Плюсса"
      },
      {
        
        name: "Порхов"
      },
      {
        
        name: "Псков"
      },
      {
        
        name: "Пустошка"
      },
      {
        
        name: "Пушкинские Горы"
      },
      {
        
        name: "Пыталово"
      },
      {
        
        name: "Себеж"
      },
      {
        
        name: "Струги-Красные"
      },
      {
        
        name: "Усвяты"
      },
      {
        
        name: "Азов"
      },
      {
        
        name: "Аксай"
      },
      {
        
        name: "Алмазный"
      },
      {
        
        name: "Аютинск"
      },
      {
        
        name: "Багаевский"
      },
      {
        
        name: "Батайск"
      },
      {
        
        name: "Белая Калитва"
      },
      {
        
        name: "Боковская"
      },
      {
        
        name: "Большая Мартыновка"
      },
      {
        
        name: "Вешенская"
      },
      {
        
        name: "Волгодонск"
      },
      {
        
        name: "Восход"
      },
      {
        
        name: "Гигант"
      },
      {
        
        name: "Горняцкий"
      },
      {
        
        name: "Гуково"
      },
      {
        
        name: "Донецк"
      },
      {
        
        name: "Донской"
      },
      {
        
        name: "Дубовское"
      },
      {
        
        name: "Егорлыкская"
      },
      {
        
        name: "Жирнов"
      },
      {
        
        name: "Заветное"
      },
      {
        
        name: "Заводской"
      },
      {
        
        name: "Зверево"
      },
      {
        
        name: "Зерноград"
      },
      {
        
        name: "Зимовники"
      },
      {
        
        name: "Кагальницкая"
      },
      {
        
        name: "Казанская"
      },
      {
        
        name: "Каменоломни"
      },
      {
        
        name: "Каменск-Шахтинский"
      },
      {
        
        name: "Кашары"
      },
      {
        
        name: "Коксовый"
      },
      {
        
        name: "Константиновск"
      },
      {
        
        name: "Красный Сулин"
      },
      {
        
        name: "Куйбышево"
      },
      {
        
        name: "Матвеев Курган"
      },
      {
        
        name: "Мигулинская"
      },
      {
        
        name: "Миллерово"
      },
      {
        
        name: "Милютинская"
      },
      {
        
        name: "Морозовск"
      },
      {
        
        name: "Новочеркасск"
      },
      {
        
        name: "Новошахтинск"
      },
      {
        
        name: "Обливская"
      },
      {
        
        name: "Орловский"
      },
      {
        
        name: "Песчанокопское"
      },
      {
        
        name: "Покровское"
      },
      {
        
        name: "Пролетарск"
      },
      {
        
        name: "Ремонтное"
      },
      {
        
        name: "Родионово-Несветайская"
      },
      {
        
        name: "Ростов-на-Дону"
      },
      {
        
        name: "Сальск"
      },
      {
        
        name: "Семикаракорск"
      },
      {
        
        name: "Таганрог"
      },
      {
        
        name: "Тарасовский"
      },
      {
        
        name: "Тацинский"
      },
      {
        
        name: "Усть-Донецкий"
      },
      {
        
        name: "Целина"
      },
      {
        
        name: "Цимлянск"
      },
      {
        
        name: "Чалтырь"
      },
      {
        
        name: "Чертково"
      },
      {
        
        name: "Шахты"
      },
      {
        
        name: "Шолоховский"
      },
      {
        
        name: "Александро-Невский"
      },
      {
        
        name: "Горняк"
      },
      {
        
        name: "Гусь Железный"
      },
      {
        
        name: "Елатьма"
      },
      {
        
        name: "Ермишь"
      },
      {
        
        name: "Заречный"
      },
      {
        
        name: "Захарово"
      },
      {
        
        name: "Кадом"
      },
      {
        
        name: "Касимов"
      },
      {
        
        name: "Кораблино"
      },
      {
        
        name: "Милославское"
      },
      {
        
        name: "Михайлов"
      },
      {
        
        name: "Пителино"
      },
      {
        
        name: "Пронск"
      },
      {
        
        name: "Путятино"
      },
      {
        
        name: "Рыбное"
      },
      {
        
        name: "Ряжск"
      },
      {
        
        name: "Рязань"
      },
      {
        
        name: "Сапожок"
      },
      {
        
        name: "Сараи"
      },
      {
        
        name: "Сасово"
      },
      {
        
        name: "Скопин"
      },
      {
        
        name: "Спас-Клепики"
      },
      {
        
        name: "Спасск-Рязанский"
      },
      {
        
        name: "Старожилово"
      },
      {
        
        name: "Ухолово"
      },
      {
        
        name: "Чучково"
      },
      {
        
        name: "Шацк"
      },
      {
        
        name: "Шилово"
      },
      {
        
        name: "Алексеевка"
      },
      {
        
        name: "Безенчук"
      },
      {
        
        name: "Богатое"
      },
      {
        
        name: "Богатырь"
      },
      {
        
        name: "Большая Глущица"
      },
      {
        
        name: "Большая Черниговка"
      },
      {
        
        name: "Борское"
      },
      {
        
        name: "Волжский"
      },
      {
        
        name: "Жигулевск"
      },
      {
        
        name: "Зольное"
      },
      {
        
        name: "Исаклы"
      },
      {
        
        name: "Камышла"
      },
      {
        
        name: "Кинель"
      },
      {
        
        name: "Кинель-Черкасы"
      },
      {
        
        name: "Клявлино"
      },
      {
        
        name: "Кошки"
      },
      {
        
        name: "Красноармейское"
      },
      {
        
        name: "Красный Яр"
      },
      {
        
        name: "Куйбышев"
      },
      {
        
        name: "Нефтегорск"
      },
      {
        
        name: "Новокуйбышевск"
      },
      {
        
        name: "Октябрьск"
      },
      {
        
        name: "Отрадный"
      },
      {
        
        name: "Пестравка"
      },
      {
        
        name: "Похвистнево"
      },
      {
        
        name: "Приволжье"
      },
      {
        
        name: "Самара"
      },
      {
        
        name: "Сургут (Самарская обл.)"
      },
      {
        
        name: "Сызрань"
      },
      {
        
        name: "Тольятти"
      },
      {
        
        name: "Хворостянка"
      },
      {
        
        name: "Чапаевск"
      },
      {
        
        name: "Челно-Вершины"
      },
      {
        
        name: "Шентала"
      },
      {
        
        name: "Шигоны"
      },
      {
        
        name: "Александров Гай"
      },
      {
        
        name: "Аркадак"
      },
      {
        
        name: "Аткарск"
      },
      {
        
        name: "Базарный Карабулак"
      },
      {
        
        name: "Балаково"
      },
      {
        
        name: "Балашов"
      },
      {
        
        name: "Балтай"
      },
      {
        
        name: "Возрождение"
      },
      {
        
        name: "Вольск"
      },
      {
        
        name: "Воскресенское"
      },
      {
        
        name: "Горный"
      },
      {
        
        name: "Дергачи"
      },
      {
        
        name: "Духовницкое"
      },
      {
        
        name: "Екатериновка"
      },
      {
        
        name: "Ершов"
      },
      {
        
        name: "Заречный"
      },
      {
        
        name: "Ивантеевка"
      },
      {
        
        name: "Калининск"
      },
      {
        
        name: "Каменский"
      },
      {
        
        name: "Красноармейск"
      },
      {
        
        name: "Красный Кут"
      },
      {
        
        name: "Лысые Горы"
      },
      {
        
        name: "Маркс"
      },
      {
        
        name: "Мокроус"
      },
      {
        
        name: "Новоузенск"
      },
      {
        
        name: "Новые Бурасы"
      },
      {
        
        name: "Озинки"
      },
      {
        
        name: "Перелюб"
      },
      {
        
        name: "Петровск"
      },
      {
        
        name: "Питерка"
      },
      {
        
        name: "Пугачев"
      },
      {
        
        name: "Ровное"
      },
      {
        
        name: "Романовка"
      },
      {
        
        name: "Ртищево"
      },
      {
        
        name: "Самойловка"
      },
      {
        
        name: "Саратов"
      },
      {
        
        name: "Степное"
      },
      {
        
        name: "Татищево"
      },
      {
        
        name: "Турки"
      },
      {
        
        name: "Хвалынск"
      },
      {
        
        name: "Энгельс"
      },
      {
        
        name: "Абый"
      },
      {
        
        name: "Алдан"
      },
      {
        
        name: "Амга"
      },
      {
        
        name: "Батагай"
      },
      {
        
        name: "Бердигестях"
      },
      {
        
        name: "Беркакит"
      },
      {
        
        name: "Бестях"
      },
      {
        
        name: "Борогонцы"
      },
      {
        
        name: "Верхневилюйск"
      },
      {
        
        name: "Верхнеколымск"
      },
      {
        
        name: "Верхоянск"
      },
      {
        
        name: "Вилюйск"
      },
      {
        
        name: "Витим"
      },
      {
        
        name: "Власово"
      },
      {
        
        name: "Жиганск"
      },
      {
        
        name: "Зырянка"
      },
      {
        
        name: "Кангалассы"
      },
      {
        
        name: "Канкунский"
      },
      {
        
        name: "Ленск"
      },
      {
        
        name: "Майя"
      },
      {
        
        name: "Менкеря"
      },
      {
        
        name: "Мирный"
      },
      {
        
        name: "Нерюнгри"
      },
      {
        
        name: "Нычалах"
      },
      {
        
        name: "Нюрба"
      },
      {
        
        name: "Олекминск"
      },
      {
        
        name: "Покровск"
      },
      {
        
        name: "Сангар"
      },
      {
        
        name: "Саскылах"
      },
      {
        
        name: "Среднеколымск"
      },
      {
        
        name: "Сунтар"
      },
      {
        
        name: "Тикси"
      },
      {
        
        name: "Усть-Мая"
      },
      {
        
        name: "Усть-Нера"
      },
      {
        
        name: "Хандыга"
      },
      {
        
        name: "Хонуу"
      },
      {
        
        name: "Черский"
      },
      {
        
        name: "Чокурдах"
      },
      {
        
        name: "Чурапча"
      },
      {
        
        name: "Якутск"
      },
      {
        
        name: "Александровск-Сахалинский"
      },
      {
        
        name: "Анбэцу"
      },
      {
        
        name: "Анива"
      },
      {
        
        name: "Бошняково"
      },
      {
        
        name: "Быков"
      },
      {
        
        name: "Вахрушев"
      },
      {
        
        name: "Взморье"
      },
      {
        
        name: "Гастелло"
      },
      {
        
        name: "Горнозаводск"
      },
      {
        
        name: "Долинск"
      },
      {
        
        name: "Ильинский"
      },
      {
        
        name: "Катангли"
      },
      {
        
        name: "Корсаков"
      },
      {
        
        name: "Курильск"
      },
      {
        
        name: "Макаров"
      },
      {
        
        name: "Невельск"
      },
      {
        
        name: "Ноглики"
      },
      {
        
        name: "Оха"
      },
      {
        
        name: "Поронайск"
      },
      {
        
        name: "Северо-Курильск"
      },
      {
        
        name: "Смирных"
      },
      {
        
        name: "Томари"
      },
      {
        
        name: "Тымовское"
      },
      {
        
        name: "Углегорск"
      },
      {
        
        name: "Холмск"
      },
      {
        
        name: "Шахтерск"
      },
      {
        
        name: "Южно-Курильск"
      },
      {
        
        name: "Южно-Сахалинск"
      },
      {
        
        name: "Алапаевск"
      },
      {
        
        name: "Алтынай"
      },
      {
        
        name: "Арамиль"
      },
      {
        
        name: "Артемовский"
      },
      {
        
        name: "Арти"
      },
      {
        
        name: "Асбест"
      },
      {
        
        name: "Ачит"
      },
      {
        
        name: "Байкалово"
      },
      {
        
        name: "Басьяновский"
      },
      {
        
        name: "Белоярский"
      },
      {
        
        name: "Березовский"
      },
      {
        
        name: "Богданович"
      },
      {
        
        name: "Буланаш"
      },
      {
        
        name: "Верхний Тагил"
      },
      {
        
        name: "Верхняя Пышма"
      },
      {
        
        name: "Верхняя Салда"
      },
      {
        
        name: "Верхняя Синячиха"
      },
      {
        
        name: "Верхняя Сысерть"
      },
      {
        
        name: "Верхняя Тура"
      },
      {
        
        name: "Верхотурье"
      },
      {
        
        name: "Висим"
      },
      {
        
        name: "Волчанск"
      },
      {
        
        name: "Воронцовка"
      },
      {
        
        name: "Гари"
      },
      {
        
        name: "Дегтярск"
      },
      {
        
        name: "Екатеринбург"
      },
      {
        
        name: "Ертарский"
      },
      {
        
        name: "Заводоуспенское"
      },
      {
        
        name: "Зыряновский"
      },
      {
        
        name: "Зюзельский"
      },
      {
        
        name: "Ивдель"
      },
      {
        
        name: "Изумруд"
      },
      {
        
        name: "Ирбит"
      },
      {
        
        name: "Ис"
      },
      {
        
        name: "Каменск-Уральский"
      },
      {
        
        name: "Камышлов"
      },
      {
        
        name: "Карпинск"
      },
      {
        
        name: "Карпунинский"
      },
      {
        
        name: "Качканар"
      },
      {
        
        name: "Кировград"
      },
      {
        
        name: "Краснотурьинск"
      },
      {
        
        name: "Красноуральск"
      },
      {
        
        name: "Красноуфимск"
      },
      {
        
        name: "Кушва"
      },
      {
        
        name: "Лесной"
      },
      {
        
        name: "Михайловск"
      },
      {
        
        name: "Невьянск"
      },
      {
        
        name: "Нижние Серги"
      },
      {
        
        name: "Нижний Тагил"
      },
      {
        
        name: "Нижняя Салда"
      },
      {
        
        name: "Нижняя Тура"
      },
      {
        
        name: "Новая Ляля"
      },
      {
        
        name: "Новоуральск"
      },
      {
        
        name: "Оус"
      },
      {
        
        name: "Первоуральск"
      },
      {
        
        name: "Полевской"
      },
      {
        
        name: "Пышма"
      },
      {
        
        name: "Ревда"
      },
      {
        
        name: "Реж"
      },
      {
        
        name: "Свердловск"
      },
      {
        
        name: "Североуральск"
      },
      {
        
        name: "Серов"
      },
      {
        
        name: "Сосьва"
      },
      {
        
        name: "Среднеуральск"
      },
      {
        
        name: "Сухой Лог"
      },
      {
        
        name: "Сысерть"
      },
      {
        
        name: "Таборы"
      },
      {
        
        name: "Тавда"
      },
      {
        
        name: "Талица"
      },
      {
        
        name: "Тугулым"
      },
      {
        
        name: "Туринск"
      },
      {
        
        name: "Туринская Слобода"
      },
      {
        
        name: "Алагир"
      },
      {
        
        name: "Ардон"
      },
      {
        
        name: "Беслан"
      },
      {
        
        name: "Бурон"
      },
      {
        
        name: "Владикавказ"
      },
      {
        
        name: "Дигора"
      },
      {
        
        name: "Моздок"
      },
      {
        
        name: "Орджоникидзе"
      },
      {
        
        name: "Чикола"
      },
      {
        
        name: "Велиж"
      },
      {
        
        name: "Верхнеднепровский"
      },
      {
        
        name: "Ворга"
      },
      {
        
        name: "Вязьма"
      },
      {
        
        name: "Гагарин"
      },
      {
        
        name: "Глинка"
      },
      {
        
        name: "Голынки"
      },
      {
        
        name: "Демидов"
      },
      {
        
        name: "Десногорск"
      },
      {
        
        name: "Дорогобуж"
      },
      {
        
        name: "Духовщина"
      },
      {
        
        name: "Екимовичи"
      },
      {
        
        name: "Ельня"
      },
      {
        
        name: "Ершичи"
      },
      {
        
        name: "Издешково"
      },
      {
        
        name: "Кардымово"
      },
      {
        
        name: "Красный"
      },
      {
        
        name: "Монастырщина"
      },
      {
        
        name: "Новодугино"
      },
      {
        
        name: "Починок"
      },
      {
        
        name: "Рославль"
      },
      {
        
        name: "Рудня"
      },
      {
        
        name: "Сафоново"
      },
      {
        
        name: "Смоленск"
      },
      {
        
        name: "Сычевка"
      },
      {
        
        name: "Угра"
      },
      {
        
        name: "Хиславичи"
      },
      {
        
        name: "Холм-Жирковский"
      },
      {
        
        name: "Шумячи"
      },
      {
        
        name: "Ярцево"
      },
      {
        
        name: "Александровское"
      },
      {
        
        name: "Арзгир"
      },
      {
        
        name: "Благодарный"
      },
      {
        
        name: "Буденновск"
      },
      {
        
        name: "Георгиевск"
      },
      {
        
        name: "Дивное"
      },
      {
        
        name: "Домбай"
      },
      {
        
        name: "Донское"
      },
      {
        
        name: "Ессентуки"
      },
      {
        
        name: "Железноводск"
      },
      {
        
        name: "Зеленокумск"
      },
      {
        
        name: "Изобильный"
      },
      {
        
        name: "Иноземцево"
      },
      {
        
        name: "Ипатово"
      },
      {
        
        name: "Карачаевск"
      },
      {
        
        name: "Кисловодск"
      },
      {
        
        name: "Кочубеевское"
      },
      {
        
        name: "Красногвардейское"
      },
      {
        
        name: "Курсавка"
      },
      {
        
        name: "Левокумское"
      },
      {
        
        name: "Минеральные Воды"
      },
      {
        
        name: "Невинномысск"
      },
      {
        
        name: "Нефтекумск"
      },
      {
        
        name: "Новоалександровск"
      },
      {
        
        name: "Новоалександровская"
      },
      {
        
        name: "Новопавловск"
      },
      {
        
        name: "Новоселицкое"
      },
      {
        
        name: "Преградная"
      },
      {
        
        name: "Пятигорск"
      },
      {
        
        name: "Светлоград"
      },
      {
        
        name: "Солнечнодольск"
      },
      {
        
        name: "Ставрополь"
      },
      {
        
        name: "Степное"
      },
      {
        
        name: "Теберда"
      },
      {
        
        name: "Усть-Джегута"
      },
      {
        
        name: "Хабез"
      },
      {
        
        name: "Черкесск"
      },
      {
        
        name: "Бондари"
      },
      {
        
        name: "Гавриловка Вторая"
      },
      {
        
        name: "Жердевка"
      },
      {
        
        name: "Знаменка"
      },
      {
        
        name: "Инжавино"
      },
      {
        
        name: "Кирсанов"
      },
      {
        
        name: "Котовск"
      },
      {
        
        name: "Мичуринск"
      },
      {
        
        name: "Мордово"
      },
      {
        
        name: "Моршанск"
      },
      {
        
        name: "Мучкапский"
      },
      {
        
        name: "Первомайский"
      },
      {
        
        name: "Петровское"
      },
      {
        
        name: "Пичаево"
      },
      {
        
        name: "Рассказово"
      },
      {
        
        name: "Ржакса"
      },
      {
        
        name: "Староюрьево"
      },
      {
        
        name: "Тамбов"
      },
      {
        
        name: "Токаревка"
      },
      {
        
        name: "Уварово"
      },
      {
        
        name: "Умет"
      },
      {
        
        name: "Агрыз"
      },
      {
        
        name: "Азнакаево"
      },
      {
        
        name: "Аксубаево"
      },
      {
        
        name: "Актюбинский"
      },
      {
        
        name: "Алексеевское"
      },
      {
        
        name: "Альметьевск"
      },
      {
        
        name: "Альметьевск"
      },
      {
        
        name: "Апастово"
      },
      {
        
        name: "Арск"
      },
      {
        
        name: "Бавлы"
      },
      {
        
        name: "Базарные Матаки"
      },
      {
        
        name: "Балтаси"
      },
      {
        
        name: "Богатые Сабы"
      },
      {
        
        name: "Брежнев"
      },
      {
        
        name: "Бугульма"
      },
      {
        
        name: "Буинск"
      },
      {
        
        name: "Васильево"
      },
      {
        
        name: "Верхний Услон"
      },
      {
        
        name: "Высокая Гора"
      },
      {
        
        name: "Дербешкинский"
      },
      {
        
        name: "Елабуга"
      },
      {
        
        name: "Заинск"
      },
      {
        
        name: "Зеленодольск"
      },
      {
        
        name: "Казань"
      },
      {
        
        name: "Камское Устье"
      },
      {
        
        name: "Карабаш"
      },
      {
        
        name: "Куйбышев"
      },
      {
        
        name: "Кукмод"
      },
      {
        
        name: "Кукмор"
      },
      {
        
        name: "Лаишево"
      },
      {
        
        name: "Лениногорск"
      },
      {
        
        name: "Мамадыш"
      },
      {
        
        name: "Менделеевск"
      },
      {
        
        name: "Мензелинск"
      },
      {
        
        name: "Муслюмово"
      },
      {
        
        name: "Набережные Челны"
      },
      {
        
        name: "Нижнекамск"
      },
      {
        
        name: "Новошешминск"
      },
      {
        
        name: "Нурлат"
      },
      {
        
        name: "Пестрецы"
      },
      {
        
        name: "Рыбная Слобода"
      },
      {
        
        name: "Сарманово"
      },
      {
        
        name: "Старое Дрожжаное"
      },
      {
        
        name: "Тетюши"
      },
      {
        
        name: "Чистополь"
      },
      {
        
        name: "Андреаполь"
      },
      {
        
        name: "Бежецк"
      },
      {
        
        name: "Белый"
      },
      {
        
        name: "Белый Городок"
      },
      {
        
        name: "Березайка"
      },
      {
        
        name: "Бологое"
      },
      {
        
        name: "Васильевский Мох"
      },
      {
        
        name: "Выползово"
      },
      {
        
        name: "Вышний Волочек"
      },
      {
        
        name: "Жарковский"
      },
      {
        
        name: "Западная Двина"
      },
      {
        
        name: "Заречье"
      },
      {
        
        name: "Зубцов"
      },
      {
        
        name: "Изоплит"
      },
      {
        
        name: "Калашниково"
      },
      {
        
        name: "Калинин"
      },
      {
        
        name: "Калязин"
      },
      {
        
        name: "Кашин"
      },
      {
        
        name: "Кесова Гора"
      },
      {
        
        name: "Кимры"
      },
      {
        
        name: "Конаково"
      },
      {
        
        name: "Красный Холм"
      },
      {
        
        name: "Кувшиново"
      },
      {
        
        name: "Лесное"
      },
      {
        
        name: "Лихославль"
      },
      {
        
        name: "Максатиха"
      },
      {
        
        name: "Молоково"
      },
      {
        
        name: "Нелидово"
      },
      {
        
        name: "Оленино"
      },
      {
        
        name: "Осташков"
      },
      {
        
        name: "Пено"
      },
      {
        
        name: "Рамешки"
      },
      {
        
        name: "Ржев"
      },
      {
        
        name: "Сандово"
      },
      {
        
        name: "Селижарово"
      },
      {
        
        name: "Сонково"
      },
      {
        
        name: "Спирово"
      },
      {
        
        name: "Старица"
      },
      {
        
        name: "Тверь"
      },
      {
        
        name: "Торжок"
      },
      {
        
        name: "Торопец"
      },
      {
        
        name: "Удомля"
      },
      {
        
        name: "Фирово"
      },
      {
        
        name: "Александровское"
      },
      {
        
        name: "Асино"
      },
      {
        
        name: "Бакчар"
      },
      {
        
        name: "Батурино"
      },
      {
        
        name: "Белый Яр"
      },
      {
        
        name: "Зырянское"
      },
      {
        
        name: "Итатка"
      },
      {
        
        name: "Каргасок"
      },
      {
        
        name: "Катайга"
      },
      {
        
        name: "Кожевниково"
      },
      {
        
        name: "Колпашево"
      },
      {
        
        name: "Кривошеино"
      },
      {
        
        name: "Мельниково"
      },
      {
        
        name: "Молчаново"
      },
      {

        name: "Парабель"
      },
      {
        
        name: "Первомайское"
      },
      {
        
        name: "Подгорное"
      },
      {
        
        name: "Северск"
      },
      {
        
        name: "Стрежевой"
      },
      {
        
        name: "Томск"
      },
      {
        
        name: "Тымск"
      },
      {
        
        name: "Ак-Довурак"
      },
      {
        
        name: "Бай Хаак"
      },
      {
        
        name: "Кызыл"
      },
      {
        
        name: "Самагалтай"
      },
      {
        
        name: "Сарыг-Сеп"
      },
      {
        
        name: "Суть-Холь"
      },
      {
        
        name: "Тоора-Хем"
      },
      {
        
        name: "Туран"
      },
      {
        
        name: "Тээли"
      },
      {
        
        name: "Хову-Аксы"
      },
      {
        
        name: "Чадан"
      },
      {
        
        name: "Шагонар"
      },
      {
        
        name: "Эрзин"
      },
      {
        
        name: "Агеево"
      },
      {
        
        name: "Алексин"
      },
      {
        
        name: "Арсеньево"
      },
      {
        
        name: "Барсуки"
      },
      {
        
        name: "Бегичевский"
      },
      {
        
        name: "Белев"
      },
      {
        
        name: "Богородицк"
      },
      {
        
        name: "Болохово"
      },
      {
        
        name: "Велегож"
      },
      {
        
        name: "Венев"
      },
      {
        
        name: "Волово"
      },
      {
        
        name: "Горелки"
      },
      {
        
        name: "Донской"
      },
      {
        
        name: "Дубна"
      },
      {
        
        name: "Епифань"
      },
      {
        
        name: "Ефремов"
      },
      {
        
        name: "Заокский"
      },
      {
        
        name: "Казановка"
      },
      {
        
        name: "Кимовск"
      },
      {
        
        name: "Киреевск"
      },
      {
        
        name: "Куркино"
      },
      {
        
        name: "Ленинский"
      },
      {
        
        name: "Новомосковск"
      },
      {
        
        name: "Одоев"
      },
      {
        
        name: "Плавск"
      },
      {
        
        name: "Суворов"
      },
      {
        
        name: "Тула"
      },
      {
        
        name: "Узловая"
      },
      {
        
        name: "Щекино"
      },
      {
        
        name: "Ясногорск"
      },
      {
        
        name: "Абатский"
      },
      {
        
        name: "Аксарка"
      },
      {
        
        name: "Армизонское"
      },
      {
        
        name: "Аромашево"
      },
      {
        
        name: "Белоярский"
      },
      {
        
        name: "Бердюжье"
      },
      {
        
        name: "Большое Сорокино"
      },
      {
        
        name: "Вагай"
      },
      {
        
        name: "Викулово"
      },
      {
        
        name: "Винзили"
      },
      {
        
        name: "Голышманово"
      },
      {
        
        name: "Губкинский"
      },
      {
        
        name: "Заводопетровский"
      },
      {
        
        name: "Заводоуковск"
      },
      {
        
        name: "Излучинск"
      },
      {
        
        name: "Исетское"
      },
      {
        
        name: "Ишим"
      },
      {
        
        name: "Казанское"
      },
      {
        
        name: "Казым-Мыс"
      },
      {
        
        name: "Когалым"
      },
      {
        
        name: "Кондинское"
      },
      {
        
        name: "Красноселькуп"
      },
      {
        
        name: "Лабытнанги"
      },
      {
        
        name: "Ларьяк"
      },
      {
        
        name: "Мегион"
      },
      {
        
        name: "Мужи"
      },
      {
        
        name: "Муравленко"
      },
      {
        
        name: "Надым"
      },
      {
        
        name: "Находка"
      },
      {
        
        name: "Нефтеюганск"
      },
      {
        
        name: "Нижневартовск"
      },
      {
        
        name: "Нижняя Тавда"
      },
      {
        
        name: "Новый Уренгой"
      },
      {
        
        name: "Ноябрьск"
      },
      {
        
        name: "Нягань"
      },
      {
        
        name: "Октябрьское"
      },
      {
        
        name: "Омутинский"
      },
      {
        
        name: "Радужный"
      },
      {
        
        name: "Салехард"
      },
      {
        
        name: "Сладково"
      },
      {
        
        name: "Советский"
      },
      {
        
        name: "Сургут"
      },
      {
        
        name: "Тазовский"
      },
      {
        
        name: "Тарко-Сале"
      },
      {
        
        name: "Тобольск"
      },
      {
        
        name: "Тюмень"
      },
      {
        
        name: "Уват"
      },
      {
        
        name: "Унъюган"
      },
      {
        
        name: "Упорово"
      },
      {
        
        name: "Урай"
      },
      {
        
        name: "Ханты-Мансийск"
      },
      {
        
        name: "Юрибей"
      },
      {
        
        name: "Ялуторовск"
      },
      {
        
        name: "Яр-Сале"
      },
      {
        
        name: "Ярково"
      },
      {
        
        name: "Алнаши"
      },
      {
        
        name: "Балезино"
      },
      {
        
        name: "Вавож"
      },
      {
        
        name: "Воткинск"
      },
      {
        
        name: "Глазов"
      },
      {
        
        name: "Грахово"
      },
      {
        
        name: "Дебесы"
      },
      {
        
        name: "Завьялово"
      },
      {
        
        name: "Игра"
      },
      {
        
        name: "Ижевск"
      },
      {
        
        name: "Кама"
      },
      {
        
        name: "Камбарка"
      },
      {
        
        name: "Каракулино"
      },
      {
        
        name: "Кез"
      },
      {
        
        name: "Кизнер"
      },
      {
        
        name: "Киясово"
      },
      {
        
        name: "Красногорское"
      },
      {
        
        name: "Можга"
      },
      {
        
        name: "Сарапул"
      },
      {
        
        name: "Селты"
      },
      {
        
        name: "Сюмси"
      },
      {
        
        name: "Ува"
      },
      {
        
        name: "Устинов"
      },
      {
        
        name: "Шаркан"
      },
      {
        
        name: "Юкаменское"
      },
      {
        
        name: "Якшур-Бодья"
      },
      {
        
        name: "Яр"
      },
      {
        
        name: "Базарный Сызган"
      },
      {
        
        name: "Барыш"
      },
      {
        
        name: "Большое Нагаткино"
      },
      {
        
        name: "Вешкайма"
      },
      {
        
        name: "Глотовка"
      },
      {
        
        name: "Димитровград"
      },
      {
        
        name: "Игнатовка"
      },
      {
        
        name: "Измайлово"
      },
      {
        
        name: "Инза"
      },
      {
        
        name: "Ишеевка"
      },
      {
        
        name: "Канадей"
      },
      {
        
        name: "Карсун"
      },
      {
        
        name: "Кузоватово"
      },
      {
        
        name: "Майна"
      },
      {
        
        name: "Новая Малыкла"
      },
      {
        
        name: "Новоспасское"
      },
      {
        
        name: "Павловка"
      },
      {
        
        name: "Радищево"
      },
      {
        
        name: "Сенгилей"
      },
      {
        
        name: "Старая Кулатка"
      },
      {
        
        name: "Старая Майна"
      },
      {
        
        name: "Сурское"
      },
      {
        
        name: "Тереньга"
      },
      {
        
        name: "Ульяновск"
      },
      {
        
        name: "Чердаклы"
      },
      {
        
        name: "Аксай"
      },
      {
        
        name: "Дарьинское"
      },
      {
        
        name: "Деркул"
      },
      {
        
        name: "Джамбейты"
      },
      {
        
        name: "Джаныбек"
      },
      {
        
        name: "Казталовка"
      },
      {
        
        name: "Калмыково"
      },
      {
        
        name: "Каратобе"
      },
      {
        
        name: "Переметное"
      },
      {
        
        name: "Сайхин"
      },
      {
        
        name: "Уральск"
      },
      {
        
        name: "Федоровка"
      },
      {
        
        name: "Фурманово"
      },
      {
        
        name: "Чапаев"
      },
      {
        
        name: "Амурск"
      },
      {
        
        name: "Аян"
      },
      {
        
        name: "Березовый"
      },
      {
        
        name: "Бикин"
      },
      {
        
        name: "Бира"
      },
      {
        
        name: "Биракан"
      },
      {
        
        name: "Богородское"
      },
      {
        
        name: "Болонь"
      },
      {
        
        name: "Ванино"
      },
      {
        
        name: "Волочаевка Вторая"
      },
      {
        
        name: "Высокогорный"
      },
      {
        
        name: "Вяземский"
      },
      {
        
        name: "Горный"
      },
      {
        
        name: "Гурское"
      },
      {
        
        name: "Дормидонтовка"
      },
      {
        
        name: "Заветы Ильича"
      },
      {
        
        name: "Известковый"
      },
      {
        
        name: "Иннокентьевка"
      },
      {
        
        name: "Комсомольск-на-Амуре"
      },
      {
        
        name: "Ленинское"
      },
      {
        
        name: "Нелькан"
      },
      {
        
        name: "Николаевск-на-Амуре"
      },
      {
        
        name: "Облучье"
      },
      {
        
        name: "Охотск"
      },
      {
        
        name: "Переяславка"
      },
      {
        
        name: "Смидович"
      },
      {
        
        name: "Советская Гавань"
      },
      {
        
        name: "Софийск"
      },
      {
        
        name: "Троицкое"
      },
      {
        
        name: "Тугур"
      },
      {
        
        name: "Хабаровск"
      },
      {
        
        name: "Чегдомын"
      },
      {
        
        name: "Чумикан"
      },
      {
        
        name: "Абакан"
      },
      {
        
        name: "Саяногорск"
      },
      {
        
        name: "Аган"
      },
      {
        
        name: "Игрим"
      },
      {
        
        name: "Излучинск"
      },
      {
        
        name: "Лангепас"
      },
      {
        
        name: "Лянтор"
      },
      {
        
        name: "Мегион"
      },
      {
        
        name: "Нефтеюганск"
      },
      {
        
        name: "Нижневартовск"
      },
      {
        
        name: "Нягань"
      },
      {
        
        name: "Покачи"
      },
      {
        
        name: "Приобье"
      },
      {
        
        name: "Пыть-Ях"
      },
      {
        
        name: "Радужный"
      },
      {
        
        name: "Сургут"
      },
      {
        
        name: "Урай"
      },
      {
        
        name: "Ханты-Мансийск"
      },
      {
        
        name: "Югорск"
      },
      {
        
        name: "Агаповка"
      },
      {
        
        name: "Аргаяш"
      },
      {
        
        name: "Аша"
      },
      {
        
        name: "Бакал"
      },
      {
        
        name: "Бреды"
      },
      {
        
        name: "Варна"
      },
      {
        
        name: "Верхнеуральск"
      },
      {
        
        name: "Верхний Уфалей"
      },
      {
        
        name: "Еманжелинск"
      },
      {
        
        name: "Златоуст"
      },
      {
        
        name: "Карабаш"
      },
      {
        
        name: "Карталы"
      },
      {
        
        name: "Касли"
      },
      {
        
        name: "Катав-Ивановск"
      },
      {
        
        name: "Копейск"
      },
      {
        
        name: "Коркино"
      },
      {
        
        name: "Кунашак"
      },
      {
        
        name: "Куса"
      },
      {
        
        name: "Кыштым"
      },
      {
        
        name: "Магнитогорск"
      },
      {
        
        name: "Миасс"
      },
      {
        
        name: "Озерск"
      },
      {
        
        name: "Октябрьское"
      },
      {
        
        name: "Пласт"
      },
      {
        
        name: "Сатка"
      },
      {
        
        name: "Сим"
      },
      {
        
        name: "Снежинск"
      },
      {
        
        name: "Трехгорный"
      },
      {
        
        name: "Троицк"
      },
      {
        
        name: "Увельский"
      },
      {
        
        name: "Уйское"
      },
      {
        
        name: "Усть-Катав"
      },
      {
        
        name: "Фершампенуаз"
      },
      {
        
        name: "Чебаркуль"
      },
      {
        
        name: "Челябинск"
      },
      {
        
        name: "Чесма"
      },
      {
        
        name: "Южно-Уральск"
      },
      {
        
        name: "Юрюзань"
      },
      {
        
        name: "Аргун"
      },
      {
        
        name: "Грозный"
      },
      {
        
        name: "Гудермез"
      },
      {
        
        name: "Малгобек"
      },
      {
        
        name: "Назрань"
      },
      {
        
        name: "Наурская"
      },
      {
        
        name: "Ножай-Юрт"
      },
      {
        
        name: "Орджоникидзевская"
      },
      {
        
        name: "Советское"
      },
      {
        
        name: "Урус-Мартан"
      },
      {
        
        name: "Шали"
      },
      {
        
        name: "Агинское"
      },
      {
        
        name: "Аксеново-Зиловское"
      },
      {
        
        name: "Акша"
      },
      {
        
        name: "Александровский Завод"
      },
      {
        
        name: "Амазар"
      },
      {
        
        name: "Арбагар"
      },
      {
        
        name: "Атамановка"
      },
      {
        
        name: "Балей"
      },
      {
        
        name: "Борзя"
      },
      {
        
        name: "Букачача"
      },
      {
        
        name: "Газимурский Завод"
      },
      {
        
        name: "Давенда"
      },
      {
        
        name: "Дарасун"
      },
      {
        
        name: "Дровяная"
      },
      {
        
        name: "Дульдурга"
      },
      {
        
        name: "Жиндо"
      },
      {
        
        name: "Забайкальск"
      },
      {
        
        name: "Итака"
      },
      {
        
        name: "Калга"
      },
      {
        
        name: "Карымское"
      },
      {
        
        name: "Кличка"
      },
      {
        
        name: "Ключевский"
      },
      {
        
        name: "Кокуй"
      },
      {
        
        name: "Краснокаменск"
      },
      {
        
        name: "Красный Чикой"
      },
      {
        
        name: "Кыра"
      },
      {
        
        name: "Моготуй"
      },
      {
        
        name: "Могоча"
      },
      {
        
        name: "Нерчинск"
      },
      {
        
        name: "Нерчинский Завод"
      },
      {
        
        name: "Нижний Часучей"
      },
      {
        
        name: "Оловянная"
      },
      {
        
        name: "Первомайский"
      },
      {
        
        name: "Петровск-Забайкальский"
      },
      {
        
        name: "Приаргунск"
      },
      {
        
        name: "Сретенск"
      },
      {
        
        name: "Тупик"
      },
      {
        
        name: "Улеты"
      },
      {
        
        name: "Хилок"
      },
      {
        
        name: "Чара"
      },
      {
        
        name: "Чернышевск"
      },
      {
        
        name: "Чита"
      },
      {
        
        name: "Шелопугино"
      },
      {
        
        name: "Шилка"
      },
      {
        
        name: "Алатырь"
      },
      {
        
        name: "Аликово"
      },
      {
        
        name: "Батырева"
      },
      {
        
        name: "Буинск"
      },
      {
        
        name: "Вурнары"
      },
      {
        
        name: "Ибреси"
      },
      {
        
        name: "Канаш"
      },
      {
        
        name: "Киря"
      },
      {
        
        name: "Комсомольское"
      },
      {
        
        name: "Красноармейское"
      },
      {
        
        name: "Красные Четаи"
      },
      {
        
        name: "Кугеси"
      },
      {
        
        name: "Мариинский Посад"
      },
      {
        
        name: "Моргауши"
      },
      {
        
        name: "Новочебоксарск"
      },
      {
        
        name: "Порецкое"
      },
      {
        
        name: "Урмары"
      },
      {
        
        name: "Цивильск"
      },
      {
        
        name: "Чебоксары"
      },
      {
        
        name: "Шемурша"
      },
      {
        
        name: "Шумерля"
      },
      {
        
        name: "Ядрин"
      },
      {
        
        name: "Яльчики"
      },
      {
        
        name: "Янтиково"
      },
      {
        
        name: "Анадырь"
      },
      {
        
        name: "Билибино"
      },
      {
        
        name: "Губкинский"
      },
      {
        
        name: "Заполярный"
      },
      {
        
        name: "Муравленко"
      },
      {
        
        name: "Надым"
      },
      {
        
        name: "Новый Уренгой"
      },
      {
        
        name: "Ноябрьск"
      },
      {
        
        name: "Пуровск"
      },
      {
        
        name: "Салехард"
      },
      {
        
        name: "Тарко"
      },
      {
        
        name: "Андропов"
      },
      {
        
        name: "Берендеево"
      },
      {
        
        name: "Большое Село"
      },
      {
        
        name: "Борисоглебский"
      },
      {
        
        name: "Брейтово"
      },
      {
        
        name: "Бурмакино"
      },
      {
        
        name: "Варегово"
      },
      {
        
        name: "Волга"
      },
      {
        
        name: "Гаврилов Ям"
      },
      {
        
        name: "Данилов"
      },
      {
        
        name: "Любим"
      },
      {
        
        name: "Мышкино"
      },
      {
        
        name: "Некрасовское"
      },
      {
        
        name: "Новый Некоуз"
      },
      {
        
        name: "Переславль-Залесский"
      },
      {
        
        name: "Пошехонье-Володарск"
      },
      {
        
        name: "Ростов"
      },
      {
        
        name: "Рыбинск"
      },
      {
        
        name: "Тутаев"
      },
      {
        
        name: "Углич"
      },
      {
        
        name: "Ярославль"
      }
];

let lastGeneratedId = 0;

// Функция для генерации уникальных id
function generateUniqueId(): number {
    lastGeneratedId++;
    return lastGeneratedId;
}

// Присваиваем уникальные id каждому объекту в массиве
CityisListObjects.forEach(obj => {
    obj.id = generateUniqueId();
});