export interface PlacemarkInfo {
    name: string;
    type: string;
    address: string;
    time: string;
    prompt: string;
}

export const PlacemarkData: Record<number, PlacemarkInfo> = {
    1: {
        name: "Van Loft",
        type: "Коворкинг",
        address: "ул. Кирова 139",
        time: "11:00 - 20:00",
        prompt: "Уточните время работы"
    },
    2: {
        name: "Первый формат",
        type: "Коворкинг",
        address: "Комсомольский просп., 122",
        time: "10:00 – 20:00",
        prompt: "Уточните время работы"
    },
    3: {
        name: "Косатка",
        type: "Коворкинг",
        address: "просп. Ленина, 2",
        time: "09:00 - 20:00",
        prompt: "Уточните время работы"
    },
    4: {
        name: "Лепота",
        type: "Коворкинг",
        address: "ул. Молодогвардейцев, 60В",
        time: "09:00 - 21:00",
        prompt: "Уточните время работы"
    },
    5: {
        name: "SvetLook",
        type: "Коворкинг",
        address: "просп. Победы, 325",
        time: "09:00 - 21:00",
        prompt: "Уточните время работы"
    },
    6: {
        name: "Верещагин",
        type: "Коворкинг",
        address: "просп. Победы, 360Б",
        time: "11:00 - 15:00",
        prompt: "Уточните время работы"
    },
    7: {
        name: "Brovki Bar",
        type: "Коворкинг",
        address: "ул. Чайковского, 149",
        time: "08:00 - 20:00",
        prompt: "Уточните время работы"
    },
    8: {
        name: "ПБУ",
        type: "Коворкинг",
        address: "просп. Победы, 168",
        time: "10:30 - 15:00",
        prompt: "Уточните время работы"
    },
    9: {
        name: "Антифриз",
        type: "Коворкинг",
        address: "ул. Свободы, 2",
        time: "09:00 - 20:00",
        prompt: "Уточните время работы"
    },
    10: {
        name: "Uranus",
        type: "Коворкинг",
        address: "ул. Свободы, 2",
        time: "10:00 - 20:00",
        prompt: "Уточните время работы"
    },
    11: {
        name: "Lidsmi",
        type: "Коворкинг",
        address: "ул. Свободы, 2, корп. 5",
        time: "09:00 - 18:00",
        prompt: "Уточните время работы"
    },
    12: {
        name: "Sobranie",
        type: "Коворкинг",
        address: "ул. Труда, 158",
        time: "15:00 - 02:00",
        prompt: "Уточните время работы"
    },
    13: {
        name: "Среди своих",
        type: "Коворкинг",
        address: "ул. Кирова, 167",
        time: "15:30 - 02:00",
        prompt: "Уточните время работы"
    },
    14: {
        name: "Tochka",
        type: "Коворкинг",
        address: "площадь МОПРа, 8А",
        time: "10:00 - 21:00",
        prompt: "Уточните время работы"
    },
    15: {
        name: "КС",
        type: "Торговый Центр",
        address: "Черкасская ул., 15",
        time: "10:00 - 21:00",
        prompt: "Уточните время работы"
    },
    16: {
        name: "Орбита",
        type: "Торговый Центр",
        address: "Свердловский тракт, 8",
        time: "09:00 - 19:00",
        prompt: "Уточните время работы"
    },
    17: {
        name: "Фиеста",
        type: "Торговый Центр",
        address: "ул. Молодогвардейцев, 7",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    18: {
        name: "Фокус",
        type: "Торговый Центр",
        address: "Молдавская ул., 16",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    19: {
        name: "Ёлки",
        type: "Торговый Центр",
        address: "ул. 40-летия Победы, 1",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    20: {
        name: "Космос",
        type: "Торговый Центр",
        address: "ул. Чичерина, 28",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    21: {
        name: "Родник",
        type: "Торговый Центр",
        address: "ул. Труда, 203",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    22: {
        name: "Курчатов",
        type: "Торговый Центр",
        address: "просп. Ленина, 86",
        time: "09:00 - 23:00",
        prompt: "Уточните время работы"
    },
    23: {
        name: "Горки",
        type: "Торговый Центр",
        address: "Артиллерийская ул., 136, корп. 3",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    24: {
        name: "Белый рынок",
        type: "Торговый Центр",
        address: "Тернопольская ул., 6",
        time: "11:00 - 22:00",
        prompt: "Уточните время работы"
    },
    25: {
        name: "Радуга",
        type: "Торговый Центр",
        address: "Российская ул., 194",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    26: {
        name: "Теплотех",
        type: "Торговый Центр",
        address: "просп. Победы, 168",
        time: "09:00 - 21:00",
        prompt: "Уточните время работы"
    },
    27: {
        name: "Башня",
        type: "Торговый Центр",
        address: "Салютная ул., 27",
        time: "08:00 - 23:00",
        prompt: "Уточните время работы"
    },
    28: {
        name: "Алмаз",
        type: "Торговый Центр",
        address: "Копейское ш., 64",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    29: {
        name: "КУБа",
        type: "Торговый Центр",
        address: "ул. Цвиллинга, 25",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    30: {
        name: "Pro coffee",
        type: "Кофейня",
        address: "просп. Ленина, 73",
        time: "09:00 - 24:00",
        prompt: "Уточните время работы"
    },
    31: {
        name: "Guligo",
        type: "Кофейня",
        address: "ул. Скульптора Головницкого, 14А",
        time: "12:00 - 22:00",
        prompt: "Уточните время работы"
    },
    32: {
        name: "Coffee to Go",
        type: "Кофейня",
        address: "ул. Молодогвардейцев, 7",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    33: {
        name: "Coffee Panda",
        type: "Кофейня",
        address: "ул. 40-летия Победы, 24",
        time: "08:00 - 20:00",
        prompt: "Уточните время работы"
    },
    34: {
        name: "Кофе и книги",
        type: "Кофейня",
        address: "ул. Татищева, 264",
        time: "00:00 - 24:00",
        prompt: "Уточните время работы"
    },
    35: {
        name: "Теплый кот",
        type: "Кофейня",
        address: "ул. Братьев Кашириных, 95",
        time: "08:00 - 20:00",
        prompt: "Уточните время работы"
    },
    36: {
        name: "Coffee Shiba",
        type: "Кофейня",
        address: "Каслинская ул., 97В",
        time: "08:00 - 21:00",
        prompt: "Уточните время работы"
    },
    37: {
        name: "Дело не в кофе",
        type: "Кофейня",
        address: "ул. Елькина, 91",
        time: "08:00 - 22:00",
        prompt: "Уточните время работы"
    },
    38: {
        name: "Twins coffee",
        type: "Кофейня",
        address: "Новороссийская ул., 118В",
        time: "09:00 - 21:00",
        prompt: "Уточните время работы"
    },
    39: {
        name: "Green&Bean",
        type: "Кофейня",
        address: "Российская ул., 110, корп. 1",
        time: "09:00 - 18:00",
        prompt: "Уточните время работы"
    },
    40: {
        name: "Симба",
        type: "Книжный магазин",
        address: "Краснопольский просп., 9",
        time: "11:00 - 19:00",
        prompt: "Уточните время работы"
    },
    41: {
        name: "Книжный город",
        type: "Книжный магазин",
        address: "ул. Дзержинского, 95Б",
        time: "09:00 - 20:00",
        prompt: "Уточните время работы"
    },
    42: {
        name: "Обмен книг",
        type: "Книжный магазин",
        address: "ул. Первой Пятилетки, 6",
        time: "12:00 - 18:00",
        prompt: "Уточните время работы"
    },
    43: {
        name: "Урал пресс",
        type: "Книжный магазин",
        address: "ул. Кирова, 5",
        time: "09:00 - 19:00",
        prompt: "Уточните время работы"
    },
    44: {
        name: "Живое слово",
        type: "Книжный магазин",
        address: "просп. Героя России Е.Н. Родионова, 13",
        time: "10:00 - 20:00",
        prompt: "Уточните время работы"
    },
    45: {
        name: "Читай город",
        type: "Книжный магазин",
        address: "Комсомольский просп., 32",
        time: "09:00 - 21:00",
        prompt: "Уточните время работы"
    },
    46: {
        name: "Учебники",
        type: "Книжный магазин",
        address: "ул. Молодогвардейцев, 35",
        time: "10:00 - 19:00",
        prompt: "Уточните время работы"
    },
    47: {
        name: "Читай город",
        type: "Книжный магазин",
        address: "ул. Труда, 203",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    48: {
        name: "Живое слово",
        type: "Книжный магазин",
        address: "ул. Комарова, 110",
        time: "10:00 - 20:00",
        prompt: "Уточните время работы"
    },
    49: {
        name: "Читай город",
        type: "Книжный магазин",
        address: "Копейское ш., 64",
        time: "10:00 - 22:00",
        prompt: "Уточните время работы"
    },
    50: {
        name: "Живое слово",
        type: "Книжный магазин",
        address: "Свердловский просп., 88",
        time: "10:00 - 20:00",
        prompt: "Уточните время работы"
    }
}